<div class="section " id="section3">
    <div class="intro">
        <div class="container">
            <div class="col-md-12 ehdaCardTitle" style="margin-top: 5em; color: #000044;">
                <h2>انجمن اهدای عضو ایرانیان</h2>
            </div>

            <div class="col-md-12" id="ehdaCardContent">

                <div class="row ehdaCardP" style="font-family: 'IRANSans', 'Tahoma'; font-style: normal; font-size: 15px;">

                    <div class="col-md-4" style="text-align: center;">

                        <img src="<?php echo asset_url() . 'images/logo.png'; ?>" class="borderRadius" style="width: 85%; margin-top: 25px; max-width: 300px;" alt="کارت اهدای عضو">

                    </div>

                    <div class="col-md-8" style="padding-top: 10px; color: #000044;">

                        اهدای عضو از افراد مرگ مغزی پدیده مقدسی است که ابعاد مختلف پزشکی، اجتماعی، مذهبی و حتی اقتصادی در آن به گونه ای درگیرند که کمتر پدیده ای را می توان با آن مقایسه کرد. از نظر پزشکی اهدای عضو و پیوند اعضا در بلندترین قله های علم پزشکی قرار داشته و نشان از توانایی علمی و تکنولوژی بالای یک کشور دارد. از طرفی ثابت شده است که بدون رضایت خانواده، اهدای عضو افراد مرگ مغزی باعث اثر بد بر خانواده و بالطبع جامعه می گردد. بنابراین ارتقای فرهنگ و آگاهی جامعه در زمینه اهدای عضو از افراد مرگ مغزی از ضروریات است.
                        <br>
                        <br>
                        در مطالعه ای که در یکی از مراکز فراهم آوری اعضای پیوندی تهران انجام شده ثابت شده است که 85% افراد مرگ مغزی از افراد کم درآمد جامعه بوده اند. بنابراین حادثه منجر به بروز مرگ مغزی می تواند با از بین رفتن یکی از نان آوران خانواده یا ایجاد صدمه روحی به خانواده باعث فقر بیشتر خانواده ای شود که خود در پایین ترین سطوح جامعه قرار داشته است.
                        <br>
                        <br>
                        نکته مهم دیگر در ارتقای فراهم آوری و پیوند اعضا در هر کشور آموزش خوب و موثر نیروها و پژوهش است که می تواند موجب کیفیت بالای این فرآیند در کشور گردد.
                        <br>
                        <br>
                        لذا با هدف ارتقای فرهنگ اهدای عضو از افراد مرگ مغزی، کمک به خانواده های اهدا کننده عضو نیازمند، ارتقای آموزش و پژوهش در زمینه فراهم آوری اعضای پیوندی و پیوند اعضا و کمک به تشکیل سیستم منسجم اهدای عضو و پیوند اعضا در کشور انجمن اهدای عضو ایرانیان با توجه به سنگینی بدنه دولت برای انجام حرکتهای اینچنینی به میدان آمد تا با استفاده از نیروهای توانمند علمی و مردمی در حمایت از این پدیده مقدس موجب ارتقای کمیت و کیفیت فرآیند اهدای عضو و پیوند اعضا از افراد مرگ مغزی در کشور گردد.

                        <br>
                        <br>
                        <p style="text-align: center;">
                            <a href="<?php echo base_url('pages/founders'); ?>" class="btn btn-primary" style="font-size: 12px;">اعضای هیات موسس</a>
                            <a href="<?php echo base_url('pages/directors'); ?>" class="btn btn-primary" style="font-size: 12px;">اعضای هیات مدیره</a>
                            <a href="<?php echo base_url('pages/trustees'); ?>" class="btn btn-primary" style="font-size: 12px;">اعضای هیات امنا</a>
                        </p>

                    </div>

                </div>

            </div>

        </div>
        <div style="clear: both; margin-top: 30px;"></div>

    </div>
</div>