<title><?php echo $site_title_fa; ?> | سفیران اهدای عضو</title>

<div style="clear: both;"></div>
<div class="intro">
    <div class="blueSection">
        <div class="container">
            <h2>سفیران اهدای عضو</h2>
        </div>
    </div>
        <div class="container" style="color: #000000;">
            <div class="col-12" id="ehdaCardContent">

                <div class="row ehdaCardP" style="font-family: 'IRANSans', 'Tahoma'; font-style: normal; font-size: 13px;">

                    <div class="col-8" style="padding-top: 10px; line-height: 24px;">

                        دوست گرامی، ارائه اطلاعات صحیح به دیگران درزمینه مبحث مقدس اهدای عضو از افراد مرگ مغزی می‌تواند باعث اشاعه این فرهنگ، بالا بردن اطلاعات جامعه، افزایش آمار رضایت خانواده‌های افراد مرگ مغزی به اهدای اعضای عزیزانشان و درنتیجه نجات جان انسان‌های بیشتری گردد.
                        <br>
                        از طرف دیگر ارائه اطلاعات غلط به جامعه توسط یک سفیر اهدای عضو - به‌عنوان نماینده انجمن اهدای عضو- می‌تواند با ضربه به این فرهنگ نوپا باعث عدم اعتماد مردم، کاهش رضایت به اهدای عضو و درنتیجه مرگ تعداد بیشتری از بیماران لیست انتظار پیوند اعضا شود.
                        <br>
                        به همین دلیل لازم است یک سفیر اهدای عضو اطلاعات کامل و جامعی از مباحث مربوطه داشته و به‌عنوان منبع موثق اطلاعات اهدای عضو در جامعه، یاری‌دهنده بیماران نیازمند به پیوند باشد؛ از طرفی درصورتی‌که شما یکی از هنرمندان، ورزشکاران یا افراد سرشناس جامعه هستید، درک صحیح شما از مسئله اهدای عضو می‌تواند باعث شود با آثار و سخنان خود، راه صحیح را به علاقه‌مندان به آثار یا شخصیتتان نشان دهید و مبلّغ مؤثری برای اهدای عضو و نجات جان بیماران باشید.
                        <br>
                        بدین منظور طرح سفیر اهدای عضو از سال 1384 توسط سرکار خانم دکتر کتایون نجفی زاده در مرکز فراهم آوری دانشگاه علوم پزشکی شهید بهشتی در بیمارستان دکتر مسیح دانشوری با کمک جناب آقای دکتر قبادی و جناب آقای دکتر شیعه مرتضی پایه‌ریزی و  با موفقیت به اجرا درآمد.
                        <br>
                        از خردادماه سال 1394 با تأسیس نخستین سازمان مردم‌نهاد  اهدای عضو با نام " انجمن اهدای عضو ایرانیان" چهار وظیفه فرهنگ‌سازی، مددکاری، آموزش و پژوهش اهدای عضو در کشور به دستور وزیر محترم بهداشت و درمان و آموزش پزشکی به این انجمن واگذار گردید.
                        <br>
                        در این راستا این انجمن با احداث 20 کمیته علمی، فرهنگی، هنری، آموزشی، پژوهشی و مددکاری بر آن است تا با ایجاد سازوکاری جدید و جذب نیروهای داوطلب مردمی در کلیه رشته‌ها با همکاری مردم ایثارگر و نوع‌دوست کشور، گامی نو در جهت بالندگی هر چه بیشتر این فرهنگ در ایران اسلامی و نهادینه‌سازی اهدای عضو در کشور بردارد.
                        <br>
                        ازآنجا که سفیران اهدای عضو خط اول پاسخگویی به سؤالات و نقاط مبهم آحاد مردم در مورد اهدای عضو و پیوند اعضا می‌باشند، آشنایی با برخی مباحث این رشته برای ایشان ضروری به نظر می‌رسد.
                        <br>
                        <br>
                        لذا  طی  مراحل ذیل برای متقاضیان شرکت در این فرآیند معنوی از الزامات همکاری با این انجمن در زمینه ارتقای اهدای عضو و پیوند اعضا در جامعه می باشد :
                        <br>
                        ۱.	مطالعه مباحث قیدشده در بخش محتوای آموزشی
                        <br>
                        ۲.	پاسخ‌دهی به سؤالات موجود در بخش آزمون سفیران   بر اساس مطالب فوق
                        <br>
                        ۳.	تکمیل فرم ثبت‌نام پس از اخذ جواب موفقیت در آزمون
                        <br>
                        ۴.	 شرکت در نخستین جلسه توجیهی آشنایی با انجمن و تبیین شرح وظایف سفیران
                        <br>
                        <br>
                        لازم به ذکر است پس از اخذ جواب موفقیت در آزمون نام متقاضی به صورت خودکار در لیست سفیران اهدای عضو ثبت خواهد گردید.


                        <br>
                        <br>
                        <p style="text-align: center;">
                            <a href="<?php echo site_url('home/safiranExam'); ?>" class="btn btn-primary" style="font-size: 12px;">آزمون سفیران</a>
                            <a href="<?php echo asset_url() . 'files/ebook/safiran-learning.pdf'; ?>" class="btn btn-primary" style="font-size: 12px;">دریافت کتاب آموزشی سفیران اهدای عضو</a>
                        </p>

                    </div>

                    <div class="col-4" style="text-align: center;">

                        <img src="<?php echo asset_url() . 'images/safiran.png'; ?>" class="borderRadius" style="width: 85%; margin-top: 25px; max-width: 300px;" alt="کارت اهدای عضو">

                    </div>

                </div>

            </div>

        </div>
        <div style="clear: both; margin-top: 30px;"></div>

    </div>