<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');

class Home extends CI_Controller {

	public $data;
    public $navbar;

    public function __construct()
    {
        parent::__construct();
        $this->data = $this->header_model->header_data();
        $this->navbar = $this->users_model->is_user();
        if($this->navbar)
        {
            $this->navbar = $this->users_model->selectUserByID($this->navbar['id']);
        }
    }
    
    /*public function _index()
	{
		$data = '';

        // angels
        $data['angels'] = $this->db->select()->from('angels_pic')->where('status', 1)->order_by('id', 'random')->limit(60, 0)->get();
        if($data['angels']->num_rows() > 0)
        {
            $data['angels'] = $data['angels']->result_array();
        }
        else
        {
            $data['angels'] = FALSE;
        }

        // news
        $data['news'] = $this->db->select(array(
            'id',
            'title',
            'time'
        ))->from('news')->where('status', 1)->order_by('time', 'DESC')->limit(10, 0)->get();
        if($data['news']->num_rows() > 0)
        {
            $data['news'] = $data['news']->result_array();
        }
        else
        {
            $data['news'] = FALSE;
        }

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $this->navbar);
        $this->load->view('new/template/slider');
        $this->load->view('new/template/main', $data);
        $this->load->view('new/template/footer', $data);
	}

    public function organDonation()
    {
        $data = '';

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $this->navbar);
        $this->load->view('new/template/organDonation');
        $this->load->view('new/template/footer', $data);
    }

    public function aboutUs()
    {
        $data = '';

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $this->navbar);
        $this->load->view('new/template/aboutUs');
        $this->load->view('new/template/footer', $data);
    }

    public function contactUs()
    {
        $data = '';

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $this->navbar);
        $this->load->view('new/template/contactUs');
        $this->load->view('new/template/footer', $data);
    }

    public function register()
    {
        $data = '';
        if($this->users_model->is_user())
        {
            redirect(base_url('users'));
            exit;
        }

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $data);
        $this->load->view('new/template/organDonation_registerForm', $data);
        $this->load->view('new/template/footer', $data);
    }

    public function safiran()
    {
        $data = '';

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $this->navbar);
        $this->load->view('new/template/safiran', $data);
        $this->load->view('new/template/footer', $data);
    }

    public function safiranExam()
    {
        $data = '';

        $data['questions'] = $this->db->select()->from('exam_questions')->where(array(
            'examId' => 1,
            'status' => 1
        ))->order_by('id', 'ASC')->get();
        if($data['questions']->num_rows())
        {
            $data['questions'] = $data['questions']->result_array();
        }
        else
        {
            redirect(base_url());
        }

        $data['safiranActivities'] = $this->db->select()->from('safiran_activities')->where('status', 1)->get();
        if($data['safiranActivities']->num_rows())
        {
            $data['safiranActivities'] = $data['safiranActivities']->result_array();
        }
        else
        {
            $data['safiranActivities'] = FALSE;
        }

        $this->load->view('new/template/header', $this->data);
        $this->load->view('new/template/navbar', $this->navbar);
        $this->load->view('new/template/safiranExam', $data);
        $this->load->view('new/template/footer', $data);
    }

    public function logOut()
    {
        $this->users_model->log_out();
        redirect(site_url());
        exit;
    }

    protected function state()
    {
        $state = '';
        $city1 = '';
        $query = $this->db->select(array('id', 'name'))->from('states')->where(array('status' => 1, 'parentID' => 0))->order_by('name', 'ASC')->get();
        if($query->num_rows() > 0)
        {
            $query = $query->result_array();
            for($i = 0; $i < count($query); $i++)
            {
                $state[$i]['name'] = $query[$i]['name'];
                $state[$i]['id'] = $query[$i]['id'];
                $city = $this->db->select(array('id', 'name'))->from('states')->where(array(
                    'status' => 1,
                    'parentID' => $query[$i]['id']
                ))->order_by('name', 'ASC')->get();
                if($city->num_rows() > 0)
                {
                    $city = $city->result_array();
                    for($a = 0; $a < count($city); $a++)
                    {
                        $city1[$query[$i]['id']][$city[$a]['id']]['name'] = $city[$a]['name'];
                        $city1[$query[$i]['id']][$city[$a]['id']]['id'] = $city[$a]['id'];
                    }
                }
            }
            $state = json_encode($state);
            $city = json_encode($city1);
            echo "var state = " . $state . ", city = " . $city;
        }
    }

    protected function convert()
    {
        $oldUsers = $this->db->select()->from('users_old')->where('status', 1)->order_by('id', 'ASC')->limit(200, 0)->get();
        if($oldUsers->num_rows() > 0)
        {
            $oldUsers = $oldUsers->result_array();
            $a = 0;
            for($i = 0; $i < count($oldUsers); $i++, $a++)
            {
                $user['nationalcode'] = $oldUsers[$i]['nationalCode'];
                $user['username'] = str_replace(' ', '', $oldUsers[$i]['userName']);
                $user['email'] = $oldUsers[$i]['email'];
                $user['password'] = $oldUsers[$i]['passWord'];
                $user['status'] = 1;
                $user['memberID'] = $oldUsers[$i]['id'] + 1500;
                $user['hash'] = hashStr($oldUsers[$i]['nationalCode']);
                $user['id'] = null;

                $this->users_model->registerNewUser($user);

                $user = $this->users_model->isUnique_nationalCode($oldUsers[$i]['nationalCode']);
                // user data
                $userData['id'] = null;
                $userData['userID'] = $user['id'];
                $userData['firstName'] = $oldUsers[$i]['firstName'];
                $userData['lastName'] = $oldUsers[$i]['lastName'];
                $userData['fatherName'] = $oldUsers[$i]['firstFatherName'];
                $userData['sex'] = $oldUsers[$i]['sex'];
                $userData['identifier'] = $oldUsers[$i]['identifier'];
                $userData['placeOfBirth'] = $oldUsers[$i]['placeOfBirth'];
                $userData['dateOfBirth'] = $oldUsers[$i]['dateOfBirth'];
                $userData['education'] = $oldUsers[$i]['education'];
                $userData['job'] = $oldUsers[$i]['job'];
                $userData['phone'] = $oldUsers[$i]['homePhone'];
                $userData['mobile'] = $oldUsers[$i]['mobile'];
                $userData['state'] = $oldUsers[$i]['state'];
                $userData['city'] = $oldUsers[$i]['city'];
                $userData['address'] = $oldUsers[$i]['address'];
                $userData['postalCode'] = $oldUsers[$i]['postalCode'];
                $userData['organs'] = "All";
                $userData['status'] = 1;
                $userData['registerTime'] = $oldUsers[$i]['registerTime'];

                $this->users_model->registerNewUserData($userData);

                $update['status'] = 2;
                $this->db->where('id', $oldUsers[$i]['id']);
                $this->db->update('users_old', $update);

            }
            echo $a;
            echo '<script>setTimeout(function(){ location.reload(); }, 5000);</script>';
        }
    }

    protected function names()
    {
        $names = $this->db->select()->from('angels_pic')->get();
        if($names->num_rows() > 0)
        {
            $names = $names->result_array();
            for($i = 0; $i < count($names); $i++)
            {
                $data['name'] = str_replace('/r/n', '', str_replace('\r\n', '', htmlCoding($names[$i]['name'])));
                $this->db->where('id', $names[$i]['id']);
                $this->db->update('angels_pic', $data);
            }
        }
    }

    protected function zzz()
    {
        $role = array('safir', 'root');
        showArray($role);
        $role = json_encode($role);
        showArray($role);
        $role = $this->encrypt->encode($role);
        showArray($role);
        $role = $this->encrypt->decode($role);
        $role = json_decode($role, true);
        showArray($role);
//        showArray(in_array('root', $role));
//        showArray(hashStr('001207'));
    }

    public function ddd()
    {
        echo 'users data';
        $data = $this->db->select()->from('safiran_data')->where('status', 2)->order_by('registerTime', 'desc')->get();
        if ($data->num_rows())
        {
            $data = $data->result_array();
            echo '<table style="font-family: Tahoma; font-size: 12px; border: 1px solid black; direction: rtl;"><thead><tr><th>ردیف</th><th>مشخصات</th><th>اطلاعات تماس</th><th>آدرس</th><th>سایر اطلاعات</th></tr></thead><tbody>';
            for ($i = 0, $n = 1; $i < count($data); $i++)
            {
                $data[$i]['act'] = json_decode($data[$i]['activity'], true);
                $data[$i]['reAct'] = '';
                if (is_array($data[$i]['act']) and count($data[$i]['act']) > 0)
                {
                    for ($a = 0; $a < count($data[$i]['act']); $a++)
                    {
                        $data[$i]['action'][$a] = $this->db->select()->from('safiran_activities')
                            ->where('id', $data[$i]['act'][$a])
                            ->get();
                        $data[$i]['action'][$a] = $data[$i]['action'][$a]->row_array();
                        $data[$i]['reAct'] .= $data[$i]['action'][$a]['title'] . '<br>';

                    }
                }
                echo '<tr style="border: 1px solid black;"><th style="border: 1px solid black;">' . $n++ . '</th>';
                echo '<td style="border: 1px solid black;">' . $data[$i]['firstName'] . ' ' . $data[$i]['lastName'] . ' <hr> ' . $data[$i]['nationalcode'] . '</td>';
                echo '<td style="border: 1px solid black;">' . $data[$i]['mobile'] . ' <hr> ' . $data[$i]['email'] . '</td>';
                echo '<td style="border: 1px solid black;">' . $data[$i]['homeAddress'] . '<br>تحصیلات:' . $data[$i]['education'] . '<br>تاریخ ثبت نام: '. pdate('Y/m/d', $data[$i]['registerTime']) .'</td>';
                echo '<td style="border: 1px solid black;">' . $data[$i]['reAct'] . '</td>';
                echo '</tr>';
            }
            echo '</tbody></table>';
        }
        else
        {
            echo 'no data';
        }
    }

    protected function em()
    {
        $email = $this->db->select('email')->from('users')->get();
        if ($email->num_rows())
        {
            $email = $email->result_array();
            $data = '';
            for ($i = 0; $i < count($email); $i++)
            {
                if (strlen($email[$i]['email']) > 1)
                {
                    $data .= $email[$i]['email'] . '<br>';
                }
            }
            echo $data;
        }
    }

    protected function usersChange()
    {
        $users = $this->db->select()->from('users')->limit(100)->get();
        if ($users->num_rows())
        {
            $users = $users->result_array();
            for ($i = 0; $i < count($users); $i++)
            {
                $users[$i]['data'] = $this->db->select()->from('users_data')->where('userID', $users[$i]['id'])->get();
                $users[$i]['data'] = $users[$i]['data']->row_array();

                $insert = array(
                    'full_name' => $users[$i]['data']['firstName'] . ' ' . $users[$i]['data']['lastName'],
                    'father_name' => $users[$i]['data']['fatherName'],
                    'national_code' => $users[$i]['nationalcode'],
                    'birth_date' => pdate('Y/m/d', $users[$i]['data']['dateOfBirth']),
                    'register_date' => pdate('Y/m/d', $users[$i]['data']['registerTime']),
                    'register_number' => $users[$i]['memberID'],
                    'status' => 1,
                );
                $this->db->insert('users_print', $insert);

            }
        }
    }

    protected function importData()
    {
        $first_name = 'حسين
جهانبخش
فهيمه
ابوالفضل
سیدعلی
اقبال
داوود
معصومه
حمید
علي اكبر
محمدکاظم
حسین
عبدالرضا 
اصغر
مصطفي
محمود
حمید
محمد
مجتبی
یونس
محسن
غلامرضا
کیومرث
حسين
رضاعلی
سيدجواد
محمود 
مسعود
غلامرضا
بهزاد
سامان
محمد
منصور
سیامک
زینب
محمود
مهرناز
علی
سارا 
ابوالحسن
کیومرث
قاسم
مسعود
محمد رحیم 
علی
تورج
سمیه
جلال
محسن
علی
امیر حسن
عين اله
حسینیار
علی
رضا
محمد مسعود
رضا
مجید
مصطفی
جواد
فرهاد 
سياوش
عطااله
رحمت اله
نادر
حمیدرضا
سمانه
عبدالرحیم
سید محمود
محمدحسن
خیراله
محسن
علی اصغر
داود
سهیلا
مجتبی
فاطمه 
عبدالعلی
مرضيه
حبیب اله
علی اكبر
معصومه
قاسم
امیر 
روح اله
محمدجواد
جمال
کریم
سید نورالدین
محمدرضا 
حسن
امیر
حسن
علی
محمد
فتح اله 
ایرج
سوسن
مهسا
حسين
یوسف
امیرمظفر
نسيم
عباس
سید نقی 
مریم
سیدعلی محمد
امير
علیرضا
محمدعلی
حسین
پروین
احسان
رامین
پروانه
موسی
حمیدرضا
مهران
قدرت اله
مهدي
مجید
فهيمه
علیرضا
سودابه
علیرضا
ژورژ
فریدون
حسن
مرتضی
غلامحسین
مینا
معصومه
محمد
منصور
نادر
احسان
فاطمه 
رضا
علیرضا
مرتضي
مرتضي
کارمن
اسماعیل
سیما
احمد
معصومه
سیده فاطمه
مسعود
ابوالفضل
میترا
پيام
علی رضا
بتول السادات
هومن
پرويز
علیرضا
ناصر 
مریم
فهيمه
احمد
مجتبی
راضیه
مسعود
علی
محمد
آزاده
زهرا
سمیه
رسول
توكا
رضا
علي
رضا 
داود
محمد
مینا
محمد
هوشیار
وحید
میرمنصور
آوازه
حمید 
مهدی
علی
هومن
محمدهادی
شهریار
نیکزاد
رضا
فرشته
شيرين
لیلا
سعیده
سمیه
مینو
محسن
نعمت
خديجه
سمیه
ملیحه
افسانه
سوده
حمید 
مرجان 
مهدی 
ناهيد
سید احمد
سید مهدی
مهدی
میترا
محمد
محمد صادق 
وحيد
سيد علي
سميرا
محمدرضا
راحله
نعمت اله
ناهید
عبدالرسول
محمود 
اميره
صادق
اميد 
عبداله
فتح اله
مسعود 
امراله
سهام
حسین
ابراهیم
سید حسام الدین
محمد جواد
غلامرضا
سیدرضا
محمدهادی
سعیده
زهرا
علیرضا
علیرضا
مریم
اردشیر
رسول
محمد 
پرویز
بهمن
سید محسن 
احمد
غلامرضا
تورج
علی
اسکندر
سیروس
حبیب 
فرهاد 
محمد علي
جهانگير
داود
علی
منصور
جلیل
علی اصغر
علی 
حمید 
علی محمد
محسن
باقر
ابوذر
مسعود 
ابوالقاسم
فرید
عزیزاله
حسین
ناصر
محمدعلی 
محبعلی
مسعود
علیرضا
مهدی
حبیب اله
علی نجات
حمیدرضا
محمدسعيد
فرامرز
هوشنگ
حیدر
محمدعلي
کاظم
البرز
محمد حسن
فريد
نورعلی 
عباس
آذين
هوشنگ
جمشید 
نوراله
مليحه
مریم
علی محمد
حسين
حسین
اکبر
عمران
زكيه
ذکریا
حسین
سعید 
کوروش
رفیع
ستار 
محمدحسن
زهرا
یوسفعلی
عبدالحمید
علی
نوروز علی 
سید عیسی
سميه
محمدطاهر
محمد
سید ابراهیم
ليلا 
بهنام
ابراهيم
مرتضی
عبدالرضا 
محمود
عزیز الله
محمود
مهدی
حسن
خسرو
محسن
ارسلان
رضا
برزو
مراد
مصطفی
یوسف
حسن
مرتضی
عبدالعلی
مهرداد
اسمعیل
مجتبی
سلمان
حسن
حسن
محمود
شهاب
سیدمحمد
محمد
یداله
سیدعلی
علی اصغر
احمدعلی
دکتر مسعود
محمدصادق
راحله 
خلیل
فرائد
علی
یونسعلی
احمد
جواد
ناهید
جواد
علی
امید
احمد
حسین
محمد
محسن
محسن
مسعود
امیر
سیما
میثم
اردشیر
حامد
عباس
محمد جمشید
فخری
نعمت الله
محمد امیر
یعقوب
بهنام 
دکتر غلامحسین
غفار
علی اکبر
ملیحه
زهره
آروین
یاسر
ارشد
سمیه 
مهناز
افشین
الهام
فرشته
نیلوفر
نجمه 
محسن
مرتضی
یاسر
محمد عرفان
جواد
میثمه
مهدی
محسن
آرزو
سمیه 
بهنام 
مهدی
صغری
دکتر مجید
مهندس سید کاظم
احمد
ذبیح اله
کامران
علی اکبر
مصطفی
دکتر داود
غلامحسین
محمدرضا
علیرضا 
سید مجتبی 
دکتر حمیده 
محسن
اسماعیل
صدیقه
حشمت اله 
علی
بهرام
ابوالقاسم
مرتضی 
محمدعلی
محمود
دکتر سجاد
سعید 
احمد 
حسن 
محسن
علیرضا 
محمدرضا 
محمود
محمدرضا
حشمت اله 
سید محمود
امیر
محمدعلی
علی
سحر
ساسان
وهاب
محسن
شیرین
روشنک
رامین
محمدهادی
علی
محمد جواد
سید حسن
حسین
حمیدرضا 
مقصود
عباس
محدثه
مرتضی
سارا
سیدعلی
سید محمد مسعود
سارا
زهرا
فاطمه
نگین 
مهدی
طناز
محمد
سیدمحمدعلی
هاجر
نغمه';

        $last_name = 'مهرابی
مسعودی
طبيعي
مداح
وثوق حسینی
بابائی
محمدحسيني دخت
جوان دلاوری
زرع دوست
شمس
نوحی
مرتضی
بهار
حبيبي پور
فلاح سهي
عبادی نرگسی
عبدی
بهرامی
نعمت اله
حاجی احمدی
محمد قاسمی
زمانیان
قدرجانی
وراميني
نقی زاده قلعه جوقی
ميرمحمدي
حبیبی
اسکندرزاده
حسن بالائي
افشار مهاجر
رحماني اقدم
متین نیا
ملک لو
مهدیخانی
صفري
ناظمی
تابنده
فصیحی کرمی
آهكي ورزنه
نوروزي
شریفی
رضازاده گودرزی
اديب كيا
اسلام پرست
جعفری
صمدی خواه
واقفی اسفیدانی
ملولی
زاهدي
نوبرپور
حسن نیا 
محمدي اصل
قیاسی
امانی
نيك پور
مجاور اسفهلان
صابری
رضوانی پور
صالح اردستاني
اسحاقی
احمدزاده
بهكامي
یگانه
شصتی
چاوشي مقدم
میرزائی
شريف
جنوبی
رضا زاده
رحیمی
روستا
پرنیان مقدم
جلالی امین
سنگینان
رضايي كلج
مغاری
علی پور
بهرامی منش
شيخ مرادي
سنگیان
شعبانی صمغ آبادی
نهایتی
چمنی انباجی
نظیفی
محمدی
مصلحی
خوشخوی
احمدی
موسوی
ابوالحسنی
منافی
ابراهیمی راد
زارعی
اعلمی
حاجیهای اصفهانی
عباسی
بنیادی
سهیلی مجد
بختیاری
كاظمي كسمائي
گرشاسبی
مظفری
خیام
دانشی
میرحسینی
حيدري نجار
حسینی
سلامي
رفیعی
كريمي
اشرفی
امینی
آزادی
شکوری مقدم
نصيري
فیروزی
حاجعلی
سلیمان پور
نقی لو 
نوري خراساني
عموزاده
حاجيعلي
رحمانيان
بیگلری
محمد زاده مونس يار
هاكوپيان
حمیدزاده کلخوران
فرخي
رجبی
رضائی برمی
مرادي
ناقوسي نياركي
بختياري
قرباني
همتی خانشیر
شهبازی
حاجي عباسعلي
شوشی زاده
زرگر
بحیرائی
صبوري
رخشانفر
نیازمند
معتضدی
یعقوب زاده
دقیق کفاشان
قوام 
محمدی میاندهی
رحمانی
دودانگه
حداد ملايري
داودی
هاشمی
هندي
حسيني نهاد
نائب ولی همدانی
علي پور
عليزاده
الماسي
حسینی
كياني عنبرستاني
مقدسی
سعیدی
اشرفی یکتا
محمد عليها
دهقانی
ابراهيمي
لطفي
بابائي
راجيان
قراگوزلو
غلامي
رمضاني
جعفری رهقی
خسروي
سلیمانی
پورکمالی
مشرف یمینی
محمدبیگی سلخوری
ابوالفضلی لنگرودی
فولادوند
بخشعلي زاده
پيروي
رهبری محمودآباد
فهیم کیسمی
علی
آگاهی
شیرزادی
عباسیون
زرگریان
ترکمان پری
صالحی فشمی
علي بلندي
شجاعی علی آبادی
عبدراسخی
عالم شناس
حسینی
نعمتي
رزم آراء
ملانوری شمسی
رضازاده كلخوران
دشت نشان
خوش سرورمویندانی
کردبچه
شهابی
دربندي
سیادتی
یوسف زاده
کلاهچیان تبریزی
تنکابنی
دهقان حقیقی لطف آبادی
حسینی
باروتي
هاشمي
نظري توكلي
رمضان نژاد
فتحي
سلیمانیان
کریمی
مطوری
بکتاشیان
مير شمسي
بهره دار
رنجبران
احمدی
نصر
ناطقی
معظم جزی
شرفی
همدانیان
شاه ولایتی
امام زاده ئی
امامی
علوی
سلیمانپور
تخشید
بصیری
بیات پور
روانشید
حیدری
فردبحرینی
نصراله زاده
جفرودی
اسد پور
علیزاده پهلوان
کوچکی
فلاح مرتضی نژاد
علیپور نظری
عیوض زاده خسروشاهی
قدم خير قاسمي
افتحی فر
پور سیفی
پورمردانی
علیزاده
ياري كذبين
پيري صوفياني
فتحي
زینال زاده
صالحی کلکناری
رحمانی
روشنگر
شاهمرادی مقدم
شعبانی
عبدالهی لاشکی
بشیری
رفيعي
غلامي
عبدلي
کرمی
قدمی تکانتپه
عصری ملکی
اسدی کرم
پورمیرزائی
مطهری
ایزد پناه
سلیمی
شفیعی
زارعی
آقائی
نوری
مطیری
توکلی
احمدي
صنعتی
کمالی مقدم
نظامی
واسعي
ذاکری زارچ
پیکانی
سعادت پور
مياحي
روشنی
بازیانی
مقدم
بیگدلی
زارعی رضایی
دهدشتیان
نجفي مهر
سیاف دزفولی
بیات
عاشق
عمرانی
احمدی
گرگين
عرب احمدي
دانائی راد
سپانلو
معصومی
فرهودی
والدین اصل
امان الهی
کردی
رضائی
غفوری
ذاکرقرآن
جوزی
آجری
کاظم زاده
حسيني رازليقي
گلابی
شیرمحمدی
رکنی
قرنيني
موسوي حجازي
فرخي
بهشتی روی
تیزنوبیک
صادقپور
اسکندرفر
پاینده
دکتر دهقان
محمدپور
رفیعی
علیزاده
امیری
صداقت
فیروزبخش
امیرسهامی
میراحمدی
تقی پور
طاهری
جلالی امین
دانا
حداد
خادمی
نیک روش
سریع الاطلاق فرد
فتاح دیزجی  
حیدرپور
رضاقلی
جوانمردی
میر
پور غلامعلی
دکا
دانشگر
خیام پور
سنائی
صالح آبادی
یوسفی
شهرابی 
فرجی
سلطان نژاد
کهکشانی
رودگر
رفیع زاده
سروری
هاشم زاده
علی پور
عباسقلی زاده
شهابی
ابراهیم زاده
مبارکی
بنائی آرانی
عسکری
اشتری
پازوکی
مومنی
 ابطحی
قمری
صمغ آبادی
چرمی
صادقکار
شفیعی
رضایی
کلانتری
داود
نیک اختر
ناصری نژاد
وحیدی
عرفانی
رضائیان
رستمی
فراهانی
فولادی فر
حسنی
هدایتی
همراهی
عبدالرحیم
زیبایی
تقی پور
کاوندی
براری
لنکرانی
شیخ محمدی
رجبی
برومند
بیانی
کسایی
مهدی
پروانه
پوررجب
شفیعی
غضنفری
دهقانی
میرزایی
حبیبی
قاسمی
میرولد
وادی دار
خزائی
اختیار
امین تفرشی
بهشتی روی
مجتهد
وحیدنیا
حاجیان
هادیان همدانی
سطوت
جعفری
معلمیان
دوستی
نعیمیان
عزیزیان
عبدالعلی زاده
غیایی
جمشیدی
اله داد
عسگری
رهنما
مخبر
پروین رو
محمودیان
بلخاری
بابایی
زندیه
صادق
دهقان طرزجانی
مستفید
عزیزیان
حسینی پور
جعفری صامت
وطنی
صدوقی
قاسمی
 بهمنیار
 سالمی
 یوسفی 
 فرهمند
 گلشنی
 جباری
 مهدی زاده
 موسوی خوانساری
 درخشان
 جلال زاده آذر
 رضوانی
بهبهانی زاده
مقصود زجاجی
 ملایی کوهی
 یوسفی مقدم
 یاهو
 آقا میرکریمی
 سید آقایی
مرعشی
ابوعلی
 حیدرزاده
پورمحمدفتالی
توتونچیان
بهزاد
پیرداوری
موسی پور
لاری
رحمانی
پورفتحی';

        $national_code = '4898321097
4898851215
3256162241
4609645343
0931296749
3359444671
5098879736
0072215283
4131881438
0589644041
0047248734
0492923728
0046543686
1239742371
0040479919
2649121289
0049747606
0569707412
0052884971
1502087936
0439120861
1239834349
0033950695
0047083451
0046519378
1239541295
3990028596
4132116913
2219744681
0451922247
2870275072
0046196625
0049432621
0043816088
0076754510
0046160000
0075372703
1755783787
3871354198
0452983312
6159069624
2063055191
1582906394
0045098670
0439686733
3257312131
0073246212
1550399799
1219252220
0067334520
0077135008
1671091604
3961342075
1621568301
0058544641
0035240571
0074139401
0049665375
0070179239
0532812824
0064208877
2753992479
1639540830
6589891761
0046163557
0558941001
0063187256
2001988079
2677676133
0049367935
5949614021
0042572207
2219484351
6599527590
0074701975
0046527801
0058084355
0452082943
3930275597
6599527248
5089756651
0054914132
0451943910
0062087436
5879806367
0048858293
0036835382
0045704260
0558773796
0047082771
1219675474
0059808934
0042489210
0941268209
0031752888
0035818042
0030096278
1699144672
0061967394
2679417399
0051671964
0044361750
0065760492
5359851422
0620224010
0063199882
6649771848
1219420174
0061893838
5519748535
0040686140
0075376709
5809746764
0074152688
0034908374
1381598684
0067213723
3731929163
4410114761
5729818750
6599813070
0073206385
2549678362
0040619184
0084817755
0039944621
1465678514
1218719133
0058581278
4578591069
1750994178
0062108212
3978358808
0067950523
6039259256
3961727104
0067348173
1753685001
0074874810
3961720959
0453156304
0049395521
2631018737
0047206365
0420954961
0042464651
0941905969
4839759316
0046171029
0452739918
0070979741
0045035040
1755348592
0061665851
4010424192
0044356544
0064450880
0068193963
0062305972
0050364162
0075825902
0491879873
0048809561
0062946803
0049467220
0072169850
2229560573
0074704206
0062032666
0061852971
0067297773
0065565126
0065408926
0052378111
0068152205
0072107677
0063743728
3732455912
0066498600
2709229201
0075323273
0075700999
0058540563
1464127905
0451330862
0492703701
3256182852
3329801115
0068165633
0060506776
0490279007
0065827406
0063036266
0062202405
0067274651
0082720134
5010841959
0064535541
0064636070
0065735587
0037436554
0074734806
0073370827
0070236178
0069374341
0061761613
0901069914
0702286133
0939479656
2110432055
0779460502
0933048823
1818566370
0939778440
0937975354
0702312010
1289705992
0680162429
0651634288
1817973967
1287619002
1287208691
1263142958
1287180655
1091959315
1290139423
1198985631
5110083045
4230805160
1285585577
1129563731
2291584774
2511179121
2371777404
2570298409
2470659124
1290633738
2296311075
2511185385
1828990477
2297018231
4839610630
2649087730
2691065375
2678146537
2648786864
2720750352
2631397258
1709716762
0071768416
1551791511
2939665478
2802404229
5679712008
1374062413
1380234451
1552477320
1580135188
5769656999
5258709469
2259780490
2279759780
4839382301
6269792721
2219304892
2142109756
2141133130
6499902901
1819358542
2948550920
5079643757
3149740355
3051426611
2992414166
3070951120
3672028916
4284816561
6489586657
4284652834
3731299550
4500696326
3874569799
3257225040
4949647040
1860209564
3549813880
4459651076
5519777373
1971197378
2002396949
1755019068
2001983018
1861049234
1755036132
1911613499
1861056605
1860237967
2291928279
1756052905
1750864029
0382358201
0533812976
0601718161
0532353404
4432411406
4579445619
2248862466
2031464981
0049716271
1466010088
5289598685
4131892871
4621785206
4849738184
2000483895
1189477343
0030134102
2669601758
1652063031
2871139644
0602529360
3520111241
0065562666
0451353668
1289549141
0049383140
1751630013
0039916261
4030742361
0044137087
0054794439
1533391181
1285472926
3874269280
3251439138
4011363707
6599369871
0039430103
0569492378
0322965624
6309701975
2218403811
3255676568
2296244629
1639045562
4172030602
1465638539
0039782255
4839533520
0491104634
1829400819
1260496201
2709352494
2721986708
0061734470
0040504220
0039091635
1261456718
6259849133
0072919450
2939138877
1650697058
4609334331
4899280335
0061046124
0035317426
0068088671
5010823799
0076253333
0064367134
0059747528
0068946937
0042592224
3341281282
0059410043
0439568331
0062005413
2091924415
2142121896
5089425876
0062244612
1261962591
2002669351
2708906453
4590173395
0047121998
1550296426
2295877296
0052245713
1239742241
0451941942
0559026846
0074333275
0079264468
5179702615
2801484644
0068278993
0480217807
3391925280
0491880510
0010800980
0013299141
0064634280
4322365469
0058581278
0057914990
3732473538
5669760638
0069700923
2279708337
0071617272
0059814535
0075248271
0067239293
0063553805
2679881184
0046087761
3932514327
0045972869
1817803069
1284437752
2295883873
0049297473
0047063971
0681600268
0041702093
3874576655
0043296556
0039704998
0491191881
4198952116
0036902365
3256037666
2750422272
3873184001
4310714714
0053297199
3874554856
2470665795
2002306354
2593208961
0041135318
5659128394
0045826201
0032286562
3256608329
0702314201
4723485309
3256037666
0052664708
0070693201
4569625495
4539547623
4723635629
0062317555
0070056145
1287411274
0079798942
0071032134
0653113196
5239834717
1284470148
2529600627
1375494333
4569223885
1815300019
0040074072
5189819035
0070216169
0065577851
0063282755
0075103753
0044496834
1911382594
0058159207
0060714301
1379392731
0069205914
0068537441
0063416352
0071056181
0079861271
0068244878';

        $father_name = 'مصطفی
خليل
غلامرضا
ابوالقاسم
سیدعباس
احمد
اکبر
مصطفی
غلامرضا
رضا
محمداسمعیل
علي محمد
حسن
حسين
محمد
حسین
احمد
محمدجواد
محمدعلی
احمد
محمدحسین
محمد
رمضانعلی
عباس
ابراهیم خلیل
سيدعلي
محمد
محمدعلی
سهراب
اسمعيل
يونس
غظنفر
علي
غلامرضا
رضا
محمد
رحیم
محمد
چراغ علي
محمدعلي
سلمان
محمد جان
محمدباقر
عزیز
امامعلی
میرزاا علی
حیدر
یداله
حسن
مسعود
محمد
شكر
کريم
سردار
ابوالقاسم
محمدحسن
گلویردی
عباس
علي اصغر
هادی
عطاءاله
محمد علي
ميرزا
محمد
فرج اله
محمدحسین
خسرو
کريم
سيد عبداله
محمد
رمضانعلی
احمد
علي اکبر
علی اصغر
منوچهر
عباس
اسماعيل
غلامعلی
محمد
رضاقلی
قربان
نادر
اعباس
خسرو
نیتعلی
ماشاءاله
علی
عزت اله
سیدعلی
عباس
علی اصغر
عبدالعلی
علی
امیر
عبدالحسين
اسداله
عبداله
اسماعیل
قدرت اله
محمد
عوض اله
علی
علی اکبر
غضنفر
سیدحسین
محمد
سیداحمد
عبدالخالق
محمدرضا
آقا رضا
عبدالوهاب
ابراهیم
زمان اله
حسن
عزت اله
حمید
محمود
محمد
عبداله
محمود
حسین
ولي الله
سادات
ذبیح اله
رضا
خاجيك
حمید
ابوالفضل
علی
عباسعلی
خيبر
ميرزا علي
کتابعلی
اسمعيل
بیت اله
روح اله
ناصر
یوسفعلی
جواد
محمد حسین
ابراهيم
حبیب اله
غلامرضا
هوشنگ
حسن
حسین
سيد رضي 
محمد
عبداله
پرويز
غلامرضا
رضاقلی
سید مصطفی
محمود
حسين
عباس
حسن
محسن
حسين
اسمعیل
اكبر
عزت اله
احمد
رضا
احمد علي
علی کرم
فرهاد
حسينعلي
رضا
كيخسرو
محمدعلی
مراد علي
محمد حسين 
محمد
مسعود
جمشید
علی اکبر
بهمن
گل محمد
میر صادق
حسين
رضا
نعمت
ایوب
محمد
مصطفي
عزیز
کاظم
نوروز
محمود
يحيي
محمدمهدی
محمد
ولی اله
اسمعیل
احمد
سيد محمد
رمضانعلي
خدابخش
قدیر
رحمان
جابر
ابراهيم
محمدرضا
بیژن
همتعلي
سید یحیی
سیدحسن
مجید
سيدصادق
ابراهیم
غلامرضا
رحيم
ابوالقاسم
محمد حسين
حسين
محمد حسن
حبیب اله
محمدحسین
حسن
صفر
رضا
کرمعلی
حسن
عباسقلی
حسین
محمد تقی
علی
غلامرضا
علی
حسن
محمدحسین
محمد صادق
سيد عبدالله
سیدحسین
محمد
حميد
محمد
حبیب
فاضل
حسن
ابوطالب
عابدین
اسداله
داود
صفرعلی
سید نقی
محمود
کریم
ايرج
محمدحسین
عبدالله
محمود
حمید
سلمان
محمد
يعقوب
غلامعلی
رضا
علی
يزدان
عیسی
محمدحسن
نظام
محمد صادق
اسماعيل
رحمان
غلامحسين
احمد
سردار علی
سلیمان
محمد
علی
علی
ابوالحسن
حسن
رضا
علی اکبر
غفار
عبداله
رشید
محمدحسن
غلامرضا
درویش نوروز
حسین
خدر
علی اکبر
محمدعلی
ساطانعلی
حسين
لازم
محمود
مندنی
محمودعلي
محمد رحیم
علیرضا
محمد ابراهیم
محمود
رضا
محمدحسن
بيرامعلي
محمد علي
شیرینعلی
شمس اله
يوسف
یوسفعلی
رمضانعلی
عبدالخواه
یوسف
شفیع
اسکندر
محمدتقی
لطف الله
حبيب
عبدالمحمد
رضا
حسین علی
سيد موسي
سيد حسن
بايز
حسين
سید نعمت اله
محمد
همايون
علي
علي
احمد
محمدصادق
ولي
علي اکبر
احمد
سراصلان
حسینعلی
احمد
حیدرعلی
فرج
حميد
محمدحسن
محمود
قنبر
طاهر
علی اکبر
احمد
محمد
الیاس
علی
علي اكبر
محمدرضا
خانعلی
احمد
مصطفی
سید محسن
محسن
حسن
سید حسین
عباس
محمد مهدي
رضا
اصغر
قاسم
حميد
سلطانعلی
غلامعلي
رمضانعلی
فرامرز
اکبر
جعفر
محمد
ناصر
ابوالفضل
محمود
مرتضی
حسین
احمد
علي
مسلم
محمد
حسين
حمید
اسماعیل
محمدصادق
غلامعلي
محمدشریف
مير نقي
محمد
امانی
علی
عبدالنبی
علی
محمد
علي اصغر
غلامرضا
عباس
مسعود
احمد
همت
غلامحسین
عباس
شیخ حسین
داوود
علی
عبدالمجید
مهدي
احمد
علی
مهدی
اسمعیل
سید قدرت
عباس
کامران
کرمعلی
قاسم
حسن
ولی
محمد
اکبر
علي حسين
سيدحسن
وجيه اله
علی
صديق پاشا
حبيب
علي
محمدعلی
محمدجان
محمود
احمد
سيد ابوالقاسم
علي اکبر 
محمد حسين
اسد
قربانعلي
حبیب
اسماعیل
علي اکبر
صادق
علي
نايب علي
ابوالقاسم
محمد
محمود
مسعود
آقاکمال
محمد
میرزا آقا
محمدعلی
رضا
احمد کاظم
حبیب اله
ابوطالب
نصرت اله
محمد
علی اکبر
مجید
مصطفی
مجید
جعفر
جمال
بهار
عباسعلی
علي اكبر
مهدي
حسين
مير محمد
تقي
خلیفه
رجبعلی
ذکریا
عبدالعلی
عزيز
میرهادی
سيد حسين
ناصر
عبدالسيد
عزت اله
رحمت اله
محمد صادق
محمود
بهروز
حسین
سیدجمال
ایرج
مرتضی';

        $id_number = '639
3
204
5
42037
93
1066
7831
71
34
2
8
3471
11
1004
810
4404
276
2018
765
471
65
57631
1232
1040
66
2098
105
46
42
27515
3608
19
35
6342
3417
2174
857
11185
18
8927
965
11
1831
6
347
3627
40370
164
9331
5602
966
840
4
30406
14698
7206
976
46
899
256
13
96
7
300
196
8922
626
754
1430
1984
1645
2
367
3058
1883
20256
39
27254
334
18
1249
109
2191
1645
1609
2826
1457
256
1164
31
42271
2641
894
74997
7027
9637
7975
8518
4
3728
1455
7627
25
1031
10214
8
583
1064
14
532
2974
162
223
4185
3
2955
200
11399
3
85
10418
799
797
21095
1432
227
25
37063
1300
26682
4278
7344
273
1025
590
2228
1925
6492
682
57
694
112
633
246
184
1600
120
1044
149
8673
1326
1293
5752
4393
934
5834
2931
495
3433
6361
284
1294
15417
3481
15286
1357
3504
15086
9950
1983
5569
5007
196
7146
2902
7324
1289
5372
327
7329
3959
29992
1451
4405
882
633
6
9834
42258
29159
2467
9930
13810
6230
18150
57
12569
568
2643
9368
9634
5569
11428
9289
1260
42
83
1207
2110432055
387
68408
93
543
1236
652
2161
16861
138
1261
1164
4004
15
1301
26
35
342
7351
237
1681
186
7533
584
150
2792
10
2548
1595
441
214
1214
26
819
5
2205
565
1267
4
47
9133
125
11
381
8
105064
101
5
14423
1279
4773
3
2
4228
1352
3
2466
322
1
1648
4031
182
18
1
356
434
562
385
4704
589
408
67
210
524
2295
21409
7
161
48
592
255
2205
120
38
411
14
775
24246
2424
3293
10010
1659
61
626
2125
1318
4
3515
87
1271
318
86
296
2244
1
49429
1
13424
2
40
1014
3
11305
5077
27
1344
2954
469
1147
1212
595
3770
1
628
1059
2988
166
2987
983
938
18
16
54
82
1334
63
87
309
1975
64
151
732
50617
426
30
12645
1116
765
884
1
1411
747
4652
43
15
645
2110
7081
4
496
7264
35875
2005
3648
1468
23902
128
12352
221
464
1487
17888
1551
2567
443
17418
1921
30034
1190
2919
21
37
598
4762
3660
3
283
6248
0480217807
2232
348
0010800980
0013299141
140
757
37063
30195
187
5
19800
214
8048
42831
6042
8071
5405
175
2662
161
5
1295
255
550
124
748
437
768
391
1032
2011
1743
55
478
278
42260
63
431074714
124
364
27
1717
10
703
2364
45
44400
533
34
22
278
515
1257
99
61
101
1663
13622
6995
53437
6058
2555
1
398
328
315
722
4002
247
1
7428
8113
8243
2498
1500
124
27825
34192
1724
1703
592
6858
10878
6698
13013';

        $birth_date = '1334/06/15
1333/01/03
1337/02/08
1334/03/15
1330/03/19
1331/07/15
1333/03/03
1362/06/18
1336/03/15
1335/06/12
1341/01/01
1332/01/10
1341/08/20
1332/04/15
1327/10/24
1338/11/16
1341/11/03
1334/09/01
1344/11/13
1340/11/14
1345/03/02
1342/06/01
1340/06/01
1332/10/14
1341/03/26
1359/05/26
1343/08/03
1340/03/04
1360/05/28
1333/11/24
1359/06/14
1334/12/05
1335/01/02
1341/01/09
1361/08/10
1333/10/20
1362/02/23
1361/04/26
1357/11/25
1334/04/01
1338/01/02
1360/06/31
1333/03/03
1341/10/27
1334/03/02
1341/05/21
1360/04/24
1345/06/01
1332/05/01
1361/11/15
1360/07/01
1329/11/14
1330/12/01
1339/08/20
1357/11/13
1342/12/11
1359/04/16
1340/04/07
1362/01/01
1332/10/05
1356/01/15
1330/01/08
1334/10/02
1329/01/01
1334/01/29
1339/03/03
1361/06/24
1335/09/01
1333/09/02
1330/07/05
1330/03/01
1337/05/24
1331/11/20
1341/09/05
1361/03/21
1341/04/15
1359/12/22
1341/05/15
1358/12/22
1335/08/10
1331/02/05
1350/01/05
1334/05/13
1359/02/16
1360/11/01
1341/05/27
1343/06/21
1341/04/10
1337/04/25
1332/09/11
1343/03/01
1360/12/29
1335/07/07
1361/02/17
1330/07/01
1337/04/15
1335/12/28
1337/06/09
1358/06/30
1358/01/09
1345/10/01
1335/10/01
1360/10/13
1332/09/05
1333/05/09
1361/08/26
1339/08/20
1359/08/14
1358/01/27
1328/05/05
1340/04/20
1362/03/17
1341/03/10
1360/01/16
1334/07/26
1340/03/15
1360/05/03
1341/04/28
1339/06/17
1333/02/05
1340/04/20
1359/09/26
1357/12/01
1336/07/04
1360/11/16
1334/06/01
1340/02/01
1332/07/01
1357/11/02
1341/06/25
1360/11/02
1359/03/18
1339/01/01
1359/01/01
1339/11/25
1341/11/06
1361/03/03
1359/06/30
1362/06/04
1340/11/29
1333/05/01
1334/03/08
1337/06/17
1339/02/15
1341/06/03
1335/01/25
1357/06/20
1360/03/05
1334/04/10
1361/01/21
1359/06/01
1338/09/10
1343/08/30
1356/06/06
1359/01/22
1335/01/01
1358/06/13
1361/02/14
1360/01/06
1339/10/03
1361/05/16
1363/02/29
1340/04/30
1360/08/07
1335/10/08
1362/07/01
1359/01/01
1361/04/26
1358/11/04
1357/06/28
1361/02/25
1359/05/12
1358/05/05
1340/08/01
1360/04/12
1362/03/20
1363/03/05
1360/06/31
1359/06/25
1336/08/30
1362/03/17
1360/06/29
1356/03/24
1359/01/01
1359/07/05
1362/02/21
1339/10/26
1359/01/06
1360/06/23
1361/12/07
1357/01/18
1361/03/18
1360/06/30
1359/05/10
1360/06/30
1365/04/20
1360/06/30
1359/11/14
1360/01/16
1360/03/07
1360/03/09
1361/11/22
1361/05/16
1362/06/20
1358/05/12
1357/02/17
1340/01/20
1330/03/04
1340/11/02
1339/11/22
1340/12/03
1345/05/20
1359/01/11
1358/03/19
1358/06/25
1333/10/15
1362/06/18
1334/11/10
1330/07/04
1337/06/05
1330/10/01
1360/10/04
1334/11/01
1360/04/15
1344/07/10
1340/09/01
1337/04/09
1340/05/01
1333/09/13
1339/11/26
1339/10/30
1342/11/26
1340/10/01
1333/04/01
1334/04/19
1332/01/02
1360/05/05
1361/07/03
1341/06/01
1342/04/17
1361/06/07
1332/01/16
1334/12/20
1343/01/04
1343/05/15
1335/11/01
1344/09/07
1340/01/05
1345/04/01
1359/05/20
1333/02/06
1335/01/08
1334/02/14
1334/04/27
1358/12/02
1359/01/09
1360/01/06
1342/09/06
1336/07/04
1347/06/25
1334/04/03
1326/02/02
1342/04/05
1342/04/27
1333/04/12
1359/06/30
1359/06/01
1359/01/27
1338/08/30
1333/09/20
1361/08/09
1329/03/02
1334/06/01
1339/06/09
1335/10/20
1338/07/05
1361/02/09
1342/06/21
1341/10/28
1332/02/04
1341/05/01
1339/04/03
1362/01/20
1337/05/03
1335/06/02
1334/01/02
1332/06/01
1340/06/06
1332/05/16
1332/04/06
1360/09/06
1335/02/01
1341/01/23
1361/01/23
1341/07/03
1341/11/10
1342/12/15
1359/05/09
1363/06/27
1341/07/10
1356/10/02
1330/06/17
1342/03/10
1357/11/29
1360/05/10
1331/01/14
1340/02/03
1340/01/01
1341/03/09
1332/06/27
1341/05/20
1338/10/22
1362/06/29
1329/04/01
1335/06/01
1337/08/01
1340/12/24
1333/08/04
1361/04/08
1334/06/22
1333/01/05
1342/12/29
1359/03/12
1360/01/01
1358/06/13
1333/11/02
1330/07/01
1333/07/02
1333/06/01
1325/04/06
1351/03/26
1335/02/17
1333/05/31
1323/10/15
1341/06/01
1322/11/09
1331/08/10
1347/03/22
1332/01/01
1334/04/01
1328/05/09
1332/11/20
1331/03/05
1359/06/30
1335/05/05
1349/02/15
1333/11/04
1329/05/28
1335/12/01
1337/2/30
1353/1/1
1359/11/04
1357/06/28
1359/05/30
1356/6/12
1329/10/30
1327/10/07
1320/11/20
1334/05/01
1357/02/25
1353/04/17
1351/01/04
1322/05/02
1325/06/01
1358/10/9
1335/12/1
1360/06/25
1359/01/01
1360/04/19
1357/06/15
1358/09/29
1355/02/24
1337/10/4
1360/05/15
1357/04/06
1338/09/01
1358/09/18
1347/03/09
1360/03/07
1329/09/03
1359/10/23
1360/05/19
1360/09/12
1359/06/10
1359/11/26
1334/10/22
1326/11/08
1332/5/11
1341/11/01
1332/10/26
1334/08/08
1361/07/21
1361/06/07
1364/03/11
1362/06/08
1358/12/01
1361/05/30
1369/06/17
1358/12/14
1363/02/26
1368/05/27
1370/02/05
1360/01/01
1363/03/08
1357/11/02
1358/12/25
1361/01/29
1337/02/30
1359/05/09
1361/3/8
1358/10/23
1360/12/26
1361/06/01
1360/06/15
1363/02/23
1367/4/30
1331/11/28
1334/04/11
1327/01/27
1333/05/01
1327/03/25
1333/07/27
1331/01/29
1331/07/12
1321/08/18
1336/06/28
1340/07/24
1333/09/07
1327/07/20
1342/03/08
1337/01/01
1339/12/12
1321/07/25
1333/12/10
1326/02/10
1326/09/20
1335/11/19
1336/03/01
1333/01/01
1363/01/01
1339/01/01
1336/07/02
1341/09/16
1344/01/10
1338/10/23
1339/09/02
1334/01/01
1339/02/20
1321/7/25
1347/2/17
1355/01/19
1323/08/17
1350/06/01
1358/01/01
1360/01/18
1361/05/24
1363/06/20
1367/01/28
1361/07/17
1364/09/04
1334/01/01
1330/05/24
1334/09/01
1322/11/14
1333/08/15
1333/06/01
1340/02/01
1338/01/01
1362/05/16
1359/06/21
1362/04/11
1360/05/28
1341/11/09
1357/06/25
1362/12/28
1358/12/05
1361/04/20
1357/02/26
1363/01/01
1362/02/23
1361/12/05
1364/04/20
1361/06/20';

        $mobile_number = '09121129393
09121132924
09123187050
09121369559
09121248284
09121045785
09121446207
09123004387
09123194713
09126721461
09123255762
09123169932
09123586567
09123330084
09123165965
09125246710
09123358615
09127005233
09123026076
09123723715
09123020258
09121961872
09125163598
09123188534
09125247638
09125081608
09123123835
09123256945
09125267100
09123440580
09126900976
09122095871
09121275410
09121238697
09127331611
09122252093
09125586164
09121598188
09121778043
09121754251
09126708231
09126708223
09125451304
09124373002
09123710833
09122087056
09128175312
09121509520
09121724373
09121465808
09126194696
09121235436
09123854435
09125136614
09126114822
09121451729
09126122900
09121506150
09125152700
09125138303
09124301165
09123773006
09126304106
09121963583
09121454471
09123160892
09122488261
09128050544
09123852773
09123195852
09125028706
09124502130
09124353510
09126120315
09124064110
09121573215
09122791334
09123059693
09126908688
09122180428
09122149522
09123389315
09124591944
09128703653
09127095710
09123004012
09122038673
09122350363
09121227393
09124227565
09123241472
09126445700
09194204940
09120265722
09122573918
09123543449
09121010624
09125210060
09121952803
09128133820
09122029208
09123759694
09192671281
09123437472
09123543327
09124936284
09125101558
09127185371
09123497756
09123936239
09121440231
09126479893
09123940392
09122060440
09125001917
09126185113
09122882315
09122017829
09123169477
09121439638
09125160677
09127253227
09121190599
09126050581
09122977945
09127213004
09122011684
09121344937
09123809408
09123025677
09128156167
09373106137
09127272018
09125132281
09123148498
09121729699
09126983090
09126055909
09125371745
09123488287
09126876130
09121897259 
09123704990
09123337212
09122935974
09122540608
09126476550
09122126850
09126035945
09123978470
09128180617
09124982453
09121984640
09121380289
09122217932
09124190273
09126300613
09123140452
09123470306
09125309430
09125378378
09124203881
09121937765
09125193703
09126787384
09125090758
09124853772
09124408188
09125354073
09123261603
09126384986
09124770841
09126768467
09123727463
09126883820
09124113063
09125027193
09126225113
09125802754
09129314695
09125955076
09124043115
09124860884
09127031485
09122113693
09124040428
09121263895
09125153498
09122999687
09125753911
09125863236
09122787407
09126616323
09125494359
09123223942
09122126599
09113001440
09125001568
09127625248
09124932616
09126772868
09121027630
09127002069
09122436524
09122189176
09122201554
09153132600
09153141196
09153131152
09153140019
09153117499
09014803780
09126094369
09153090365
09153115404
09155153316
09153075071
09155850301
09151636539
09131094851
09133133118
09131288048
09131625226
09131677643
09131692304
09131149031
09133816253
09133119995
09133104439
09133192311
09133194009
09173055226
09171817321
09173087118
09177153185
09177917662
09178189953
09177068620
09177826335
09173088020
09171152186
09111385147
09111830492
09113443014
09113334265
09113836397
09113424034
09141107851
09141164272
09141149631
09143210904
09143009329
09144113862
09144125276
09143045045
09141181423
09141181422
09141913369
09111540803
09111138474
09113148188
09111926698
09113932466
09113927103
09112934592
09112211795
09112203342
09177023962
09173611606
09141451267
09126778088
09131425186
09131915200
09131407658
09131403225
09151416069
09125236421
09128827066
09121414931
09183734198
09183410495
09188117903
09183397378
09183333293
09173413564
09173716669
09131527212
09131564091
09163134305
09161415683
09166125681
09161119809
09166517542
09166016744
09169121700
09161523543
09163012387
09352140863
09163046686
09122602914
09127474830
09181615092
09121553049
09125787278
09127311071
09123733133
09113711632
09111760335
09143522605
09144524962
09163679742
09161619901
09132834336
09121699849
09125679634
09121674620
09122626722
09123616891
09127138434
09122657176
09124650256
09126836847
09122897959
09127186023
09131027931
09123987899
09121400975
09126364649
09123935965
09121227045
09125215155
09126721195
09124132342
09124408014
09123861125
09123494531
09121484034
09393906466
09125333558
09121232454
09123907099
09121021691
09123447651
09122471074
09123799539
09121594009
09123116800
09121768917
09111320002
09121325767
09121073550
02188970511
09122846962
09127032429
09123102115
09123801448
09126399793
09121027966
09125229138
09126365210
09124062206
09123188346
09121754691
09124390205
09129455545
09128167465
09123140806
09125334298
09122727577
09123708918
09127249709
09121075789
09123475113
09124356152
09124784929
09123498003
09126431306
09121796274
09125300805
09121397411
09124603903
09352486799
09125455660
09123997335
09126779050
09121389930
09125509390
09121017900
09121057598
09121571524
09121671439
09122207761
09124725720
09125506091
09125501227
09123963996
09125339146
09364033094
09127396092
09122712275
09127084978
09358268211
09122056926
09122332895
09123809408
09128409194
09122026256
09122025210
09191308657
09121787433
09120939597
09125750194
09122768187
09196296459
09369122827
09119339347
09121117594
09121116158
09126364877
09126723463
09123169346
09121217600
09126365209
09121504595
09121058716
09123841803
09126701315
09121246155
09121234361
09121234361
09121170018
09121221242
09121121369
09126580341
09121251855
09121202930
09121764786
09121992275
09126002798
09122017000
09121304142
09121909046
09122995291
09122089427
09125710774
09121096492
09121343295
09122242896

09122191060



09124765765
09123549069
09122347993
09126103866
09124358864
09125597269
09376159955
09153041678
09131189090
09171115296
09141152136
09113574367
09161135875
09123867129
09352555543
09127215274
09126358547
09122959572
09121341469
09125100395
09122494104
09122766470
09121950592
09122901700
09122753105
09122305684
09122941932
09122860943
09123093157
09121789212';

        $first_name = explode("\n", $first_name);
        $last_name = explode("\n", $last_name);
        $father_name = explode("\n", $father_name);
        $birth_date = explode("\n", $birth_date);
        $national_code = explode("\n", $national_code);
        $id_number = explode("\n", $id_number);
        $mobile_number = explode("\n", $mobile_number);
        //echo count($first_name) . ' - ' . count($last_name) . ' - ' . count($father_name) . ' - ' . count($birth_date) . ' - ' . count($national_code) . ' - ' . count($id_number) . ' - ' . count($mobile_number);
        for ($i = 0, $a = 1; $i < count($first_name); $i++) {
            echo $a++ . ' - ' . $national_code[$i];
            $birth_date[$i] = explode('/', $birth_date[$i]);
            $date = pmktime(0, 0, 0, $birth_date[$i][1], $birth_date[$i][2], $birth_date[$i][0]);
            $birth_date[$i] = $date;
            if (!$this->users_model->isUnique_nationalCode(htmlCoding($national_code[$i])))
            {
                echo '<span style="color: green;"> not dupli</span>';
                $memberID = $this->users_model->find_last_memberID();
                if ($memberID) {
                    $memberID++;
                } else {
                    $memberID = 1500;
                }
                if (strlen(htmlCoding($mobile_number[$i])) == 11)
                {
                    $mob = htmlCoding($mobile_number[$i]);
                }
                else
                {
                    $mob = '09121234567';
                }
                $userInsert = array(
                    'nationalcode' => htmlCoding($national_code[$i]),
                    'username' => htmlCoding($national_code[$i]),
                    'password' => hashStr(htmlCoding($mobile_number[$i])),
                    'status' => 1,
                    'memberID' => $memberID,
                    'hash' => hashStr(htmlCoding($national_code[$i])),
                    'res2' => 1,
                );
                $this->users_model->registerNewUser($userInsert);
                echo '<span style="color: blue;"> - insert ok </span>';
                $user = $this->users_model->isUnique_nationalCode(htmlCoding($national_code[$i]));
                if ($user)
                {
                    $userDataInsert = array(
                        'userID' => $user['id'],
                        'firstName' => htmlCoding($first_name[$i]),
                        'lastName' => htmlCoding($last_name[$i]),
                        'fatherName' => htmlCoding($father_name[$i]),
                        'sex' => 1,
                        'identifier' => htmlCoding($id_number[$i]),
                        'placeOfBirth' => 'تهران',
                        'dateOfBirth' => $birth_date[$i],
                        'phone' => $mob,
                        'mobile' => $mob,
                        'state' => 8,
                        'city' => 135,
                        'organs' => 'All',
                        'status' => 1,
                        'registerTime' => time() + 172800,
                    );
                    $this->users_model->registerNewUserData($userDataInsert);
                    echo '<span style="color: orange;"> - insert data ok </span>';
                }
            }
            else
            {
                $user = $this->users_model->isUnique_nationalCode(htmlCoding($national_code[$i]));
                $upData['res2'] = 1;
                $this->users_model->userUpdateField($user['id'], $upData);
                echo '<span style="color: red;"> dupli</span>';
            }
            echo '<hr>';
        }

    }
*/
    public function invitees()
    {
        $name = 'ابراهیمی
ابراهیمی اکبر
ابراهیمی علیرضا
ابراهیمی نیا
ابوالحسنی
ابوالنژادیان فرهاد
ابوطالب سعید
اتحاد حسین 
اثنی عشری فائزه
احمدی رضا
احمدی سجاد
احمدی فریدون
احمدیان
اخلاقی فیض آثار هادی
اخوان بهابادی   مهدی 
اخوت اکبر
ادیانی راد سیدعلی
ارجمند بهار
ارجمند داریوش 
ارشادی همایون 
ارگانی
ازاری
اسدی تورج 
اسدی لاری
اسماعیلی
اسماعیلی پرویز
اسماعیلی حامد
اسماعیلی داریوش
اسماعیلی ندیمی علی
اشتری حسین
اشناب
اصدقی
اصغری غلامرضا
اصلاح   ابراهیم 
اعتمادسعید  صدیقه
اعتمادی  فرهاد 
اعرابی محمدحسین
افجهی
افشار سارا 
افشار مهناز
افشاردوست
اکبرپور
اکبری
اکبری علی 
اکبری کامرانی احمد علی 
اکبریان عزیز
اکرمی روابط بین الملل وزارت
الفت
الماسی  جواد 
امام وردی شهریار
امامي محسن
امامی رضوی سیدحسن
امانی طهرانی محمود
امیدوار رضایی
امیر علوی
امیرآبادی فراهانی احمد 
امیرسلیمانی کمند
امیری
امیری خامکانی حسن
امین
امین الاسلام
امین لو حسن
امینی فرد محمدنعیم
امینی فرد مهران 
انتظامی حسین
انصاری
انصاری
انصاری علی
انصاری غلامرضا
اوحدی سعید
اویسی مازیار 
ایازی سید محمد هادی 
ایدنی اسماعیل
ایرانی خواه ابوالفضل
ایرجی هومان
ایرجیان محمد
ایمانیه محمدهادی
ایوبی حجت ا...
آب پرور
آباد معصومه
آبروانی  نسرین 
آخوندی
آدابی 
آذری
آریا
آزادی خواه احد
آسترکی پیمان 
آشنا حسام الدین
آشوری تازیانی محمد
آقازاده جواد
آقازمانی  محمدحسین 
آقایان
آگاه
آموزنده علیرضا
بارانی ناهید 
باستان مصطفی
باستانی  لعیا 
باقري عليرضا 
باقري لنكراني كامران 
بالاپور سعید
باهنر   نهضت 
بائوج لاهوتی مهرداد
بحرینی
بحرینی  امین 
بختیاری بهنوش 
بخشنده
بدیعی شاهرخ
برازش  علیرضا 
بروجردی علاءالدین
برومند
بصيري عباس
بصیری
بلوچستانی
بنی اسدی علیرضا
بنیادی بهروز
بهادر علی 
بهادری سیدهادی
بهبودی
بهرامي
بهرامی هما
بهروز محمدرضا 
بهفر
بوالی  مهندس عبدالرضا 
بیان الحق   سعید 
بیداری علی
بیگلر
بیگلری علیرضا
پاکدل حسین 
پاکدل مهدی
پاکرو
پاکزاد مقدم  سید حمید 
پالیزبان ندا
پایدار رضا 
پایمرد اکوان 
پدرو آنتونیو ویینا پرز 
پرویزیان کورش
پروین علی
پریدار یوسف
پزشکیان مسعود
پژمان فر نصراله
پسیانی آتیلا 
پشت کوهی
پورابراهیمی داورانی محمدرضا
پوربافرانی عباسعلی
پورحسین
پورحسین   رضا 
پورحسینی پرویز
پورزرندي حسین محمد
پورسرخ پوریا 
پورشمسی  محمد 
پورفتح ا... علی اکبر
پورفرضی فرهاد
پورمحمدی علی اصغر
پورمند
پیرنبی خواه حمید 
پیرهادی محسن
پیریایی محمد
پیوندی علی اصغر 
تابع قانون 
تاجدار سیدرسول
تاجگردون غلامرضا
تارا سید احمد
تارا سید محمد
تارا سیدمحمود
تارخ امین 
ترکی اکبر
تشکری نیا اکبر
تفرشی امین
تقوایی محمدرضا
تقوی سهیل
تقی پور رضا
تقی زادیه علی 
تندگویان محمدمهدی
تنها
توانا
توانا مهدیه
توکلی حراست وزارت بهداشت
توکلی سیدامیرحسین
توکلی نژاد اکبر
ثقفی کامیار
جادری مدیا
جادمانی نورمحمد
جامه بزرگ کیوان
جان بابایی قاسم
جاویدنیا رضا
جدید  حسین 
جدیدی عباس
جراحی محمود
جعفرپور جمشید
جعفرلو
جعفريان علی
جعفری 
جعفری جلوه  محمدرضا 
جعفریان
جلودار زاده سهیلا
جمالی
جمالی سوسفی منوچهر
جمالیان هادی
جمشیدی
جمشیدی پژمان 
جمشیدی محمودرضا
جمشیدی منصوره
جمی محمود 
جنتی علی
جهانگیری
جوادی
جوانمردی شهاب
جواهریان نگار 
جوکار سالار
چاوشی بهنام
چقایی مصطفی 
چکشیان
چگینی   علی 
چمران مهدی
چمن رضا
چنانه  عباس 
چهرازی مهیار 
حاج جعفری محمد 
حاج سید سلیمان علی
حاج سید سلیمان علی
حاج عبدالهی هومن
حاجی آقاجانی محمد
حاجی پور رامبد
حاجی میراسماعیل سیدجواد
حاجیلو
حافظی رحمه ا...
حاکان تکین رضا 
حبیبی
حداد عادل غلامعلی
حریرچی ایرج
حسن بیگی ابوالفضل
حسن وند حاج فریدون
حسنی ابراهیم
حسنی سیدعباس
حسین زاده محمدرضا
حسین مردی
حسینی
حسینی
حسینی
حسینی  افسانه 
حسینی سیّد تیمور 
حسینی سید احمد
حسینی سیدمجید
حسینی وحید
حشمت نیا
حق بین علی 
حق دوست علی اکبر
حقانی محمد
حکیم زاده  حسین 
حکیمی پور احمد
حکیمی دانیال 
حمزه ای احمد
حمیدی
حمیدیه   امیرعلی 
حیدری
حیدری مریم 
خاتمی سیدمرتضی
خادمی فائز
خاطرنشان  پریسا 
خالقی  ابراهیم 
خالقی بشیر
خانزاده عبداله
خدادادی سلمان
خدادوست محمود
خداوردی حسن
خرم
خرم خورشید حمیدرضا
خرمي شیرین
خسروی علی
خشنودی
خطيب  علی اکبر 
خلیفه سلطانی مریم 
خلیفه محمدرضا 
خندان محمد
خواجه حسنی خسرو
خواجه علی 
خواجوی
خوش گفتار
خیراللهی شیدا 
خیریه عباس 
داروغه زاده   ابراهیم 
داسار حسین 
دانش جعفری داود
دانشور فاطمه
داود نژاد علیرضا
داودآبادی فراهانی محمدرضا
داوري حمیدرضا
داوری
داوری اردکانی رضا
داوود نژاد  رضا
داوودی حسین
دائمی بهاره
دباغ
دبیر علیرضا
درخشنده پوران 
درفشی حمید
دزفولی علیرضا
دزفولی همراه اول
دشتی
دل پیشه علی
دلشاد
دنیا مالی احمد
دهقان شقایق
دهقان علی
دهقانی
دهقانی ساناز
دهقانی فیروز آبادی کمال
دهقانی محمد 
دهکردی علی
دهنادی مقدم  انوش 
دوستی اسماعیل
دیزجی
دیناروند رسول
ذوالقدر فاطمه
راستگو الهه
راستی پیشه  طاهره 
ربیعی سیدمظفر
رجبی معمار مجید
رحمانی
رحمانی جاوید
رحمانی خسرو 
رحمانی فضلی
رحمانیان  محمدصادق 
رخام شراره 
رستمیان علی
رسول اف 
رشیدی نژاد حمیدرضا
رضا داد
رضا زاده حسین
رضاداد 
رضایی الهه
رضایی حبیب
رضایی کوچی محمدرضا
رضائی عدل رضوان
رضائی مسعود
رضوی
رضوی عاطفه
رضویان جواد
رفیعی خسرو
رفیعی فر
رفیق دوست محسن 
رنجبر زاده اکبر
رهنما بهاره
روحی علی
روشنعلی 
رویا تیموریان
ریاحی تقی
رئوفی 
رئوفی عاطفه
رئیسی علیرضا
زارع زاده محسن
زارع نژاد عباس
زارعان  علی 
زالی علیرضا
زاهدی محمدمهدی
زحمتکش اعظم
زراعتی
زرگر حمید
زکریایی  زکریا 
زمانی
زمانی مصطفی 
زندگانی امید
زندگانی امین
زنگنه
زین العابدین  مجید 
ساجدی
ساجدی نیا حسین
ساردویی نسترن 
ساری   حسین 
ساعی هادی
ساکی کورش
سالاری محمد
سالاریان
سالاریان زاده
سالک کاشانی احمد 
سام زاده محمد
سبک پا
سرخو محسن
سرزعیم
سرسبز عبدالرزاق 
سرشار  محمد 
سرمدیان حسین
سروری پرویز
سروش ابوالفضل
سری واستاوا
سعیدی نژاد سعید 
سعیدی نژاد مجید
سفیدی   احمد 
سلحشوری پروانه
سلطانی (پزشکی قانونی)
سلطانی سهیلا 
سلطانی شهره
سلوکی محمد
سلیمانی اکبر
سلیمی آشتیانی هاشم
سمیعي فر امیر
سنجری 
سهرابی
سهمانی محمدعلی
سوداوی محمد 
سيم فروش ناصر
سیاح  زهرا 
سیاری علی اکبر
سیاه کویی صدیقه 
سیاوشی شاه عنایتی طیبه
سید حسین خادمی
سیف محمد عبید الزعابی
شادنوش مهدی
شاعری علی محمدی
شاکری   عباس
شاکری اقبال
شاکری مجتبی
شانه ساز
شاه حسینی حمیدرضا
شاه میرزا  نوشین
شتابی حمیدرضا
شجاع پوریان ولی اله
شجاعی  حسین 
شجاعی احمد
شريف كاشاني بابک
شریعت   بهاءالدین 
شریعت پناهی سید فضل اله
شریفی نیا مهراوه 
شفقی شادی
شفقی مسعود
شفیعی
شکرابی رامبد 
شکیب 
شمس
شمس قاسم 
شهرابی بانک پاسارگارد
شهریاری حسینعلی
شهریوری  کامران 
شیبانی عباس
شیخ  مهدی
شیرکانی امیر
شیشه گر ابوالفضل 
شیله باف
شیویاری یعقوب 
صابری
صابری علی
صابری نژاد  ابراهیم 
صادق پور محمود
صادقی پریسا 
صادقیان ژاله
صالحي مهرداد
صالحی  محمدرضا 
صالحی پرستو
صالحی سید عباس 
صحرایی رضا 
صحرائیان
صحرائیان
صدرالسادات سیدعلی
صدراللهی
صدری سیدمجید
صدوقی وحید
صدیقی   ثمین 
صفاریان پور 1
صفاریان پور 2
صفی خانی
صلاحی  محمود 
صمدی  ولی ا...
صمدی(سرپرست کمیته انیمیشن)
صومی محمد حسین 
صیقلی محمدحسین
ضاربان ایرج
ضیا علی
ضیایی محمد 
طاهر احمدی حسن
طباطبایی 
طباطبایی نژاد سیدصادق
طلایی مرتضی
طلیعی   کبری 
طیبی معصومه
عابدی
عابدی حیدرعلی
عالی پور منصور
عالیدایی
عبادیان
عبادیان محمدرضا
عباسي علیرضا
عباسی  ساسان 
عبداللهی
عبداللهی احمد
عبداللهیان
عبدالهی  مجتبی 
عبدی عزت اله
عراقچی  سیدمجتبی
عراقچی سیدمرتضی
عربی مژده
عسکری علیرضا
عسکریان
عسگری
عسگری سعید
عصار علیرضا
عظیمی نژاد محسن
علامه
علي محمدي 
علی اکبریان
علی بن حمد السلیطی
علی پور صدف
علی عسکری 
علیجانی زمانی محسن
علیخانی احسان
علیزاده   عیسی 
عماد 
عنابی
عنایب الله باشی
عنایتی نسب علیرضا 
عين اللهي بهزاد 
غریب زاده عبداله 
غفاری 
غفاری 1 (سازمان غذا دارو)
غفاری 2 (وزارت بهداشت)
غفاری رزیتا
غفاری علیرضا
غفوری  سلیم 
غلامرضایی
غلامی
غلامی  سیاوش 
غلامی زهرا 
غیاثی
غیاثی فریده 
فادی حاج علی
فاضل ایرج
فتاح پرویز
فتاحی
فتحعلی
فتحی افشین
فراهانی
فراهانی کیانا
فرخ
فردوسی پور
فرهادی ابراهیم 
فرهادی زاد
فرهادی محمد
فرهبد
فرهنگ شاهین
فرهنگی
فروتن علی
فروتن محمدرضا
فروزان نیا
فروزش فرد  محمد
فشنگ چي مریم
فغانی علیرضا 
فقیهی 
فولادوند حدیث
فیاض
فیروزی ایرج
قاسمي مجید
قاسمی
قاسمی 
قاسمی   محمدمهدی 
قاسمی  محمدحسین 
قاسمی ثریا
قاسمی سحر
قاضی زاده هاشمی سیداحسان
قاضی زاده هاشمی سیدامیرحسین
قاضی زاده هاشمی سیدحسن
قالیباف محمدباقر
قانعی مصطفی
قائمی کاظم
قدس احد 
قدیمی طیب
قربانی محمدحسین
قزلباش پرویز 
قزوینیان
قسیم عثمانی محمد
قصری هومن 
قضایي خاتم
قضایي زهرا
قمشه منصور
قناعتی ابوالفضل
قنبری
قهاري پیمان 
قهرمانی  رویا 
قوام زاده اردشیر
قوامی هادی
كاظميني سیدمحمد
کاتب غلامرضا
کاردان داریوش
کارگری محمدرضا
کارلوس آراگون
کاسبی محمد
کاشانی حبیب
کاظم پور شمسی
کاظمی  محمد
کاظمی حمیدرضا
کاظمی کامران
کاظمیان علیرضا 
کامرانیان هومن 
کاوه
کباری مجتبی
کبیر
کثیری
کجوری
کجوری
کرد جمشیدی عبدالنور
کرمی   حسین 
کرمی احسان
کرمی نیما
کریم حسین
کریمان  ناصر 
کریمی  قاسم 
کریمی یاسمن
کشاورز حسین
کشمیری  سعید 
کلانتر
کلانتری بهزاد
کلانتریان
کمالی پور یحیی
کمایی  محمدحسن 
کمایی مقدم ابوطالب
کنزی مسعود
کوچک زاده لیلی
کوچکی نژاد کیانوش
کولیوند   پیرحسن 
کولیوند محمدجواد
کوهپایه زاده جلیل
کیانیان رضا
کیایی مهدی
کیوانی
گرایلی 
گردان اسدا...
گزانی مهین
گل مکانی ابراهیم
گلستاني مهدی 
گلستانی علیرضا 
گنج صغری 
گنجی
گودرزی فاطمه
گودرزی محمود
گوهری علی 
گیلانی مجید 
لادی مقدم
لاریجانی محمدباقر
لرستانی شهره
لسان پزشكي محبوب
لشکری محمدحسین
لطیفی محمد حسین 
لنکرانی
لیاقت
مازنی
ماندگار محمدحسین
ماهر
مجیدی مجید
محب‌حسینی   محدثه 
محبی نیا جهانبخش
محجوب عبدالرضا 
محسنی آقای ابوالحسن 
محمدزاده محمدجعفر 
محمدی داود
محمدی ساردو محمدرضا
محمدی ساره 
محمدیان
محمدیان مژگان 
محمود زاده جلال
محمودیان   احمد 
محنتی هادی 
مخبر دزفولی محمدرضا
مخبر سجاد
مختاباد عبدالحسین
مدقق سعید
مرادخانی علی
مرادی
مردانشاهی علیرضا
مردانی 
مرسلی مصطفی
مرشدی
مرندی سید علیرضا
مزینانی آسیه
مستکین    عبدالمهدی 
مسجد جامعی   احمد
مسعودی اصغر
مسلم  علیرضا
مشایخی جمشید
مصلی نژاد
مطلبی کاشانی هاشم
مطهری علی
مظفری مجید 
مظفری محمدرضا 
مظلومی  شکر اله 
معتمد آریا فاطمه
معتمدي 
معدن کن  سعید
معصوم زاده  محمد 
معلم دامغانی
معماریان
مقدس  فاطمه
مقدم
مقدم نودهی محمدابراهیم
ملانوروزی مجید
ملک حسینی سیدعلی
ملک زادگان علیرضا 
ملک زاده رضا
ملکشاهی الهیار
منصوری محمدرضا 
مهدی
مهدی پور
مهدیزاده 
مهرابی بهار مصطفی
مهرام منوچهر
مهرگان
مهری تقی
مهنام    شیدا 
موسوی بهار سیدحبیب اله
موسوی سهیلا
موسوی سید داود 
موسوی سیدعباس
موسوی سیدفرید
موسوی لارگانی سیدناصر
مولایی
مومنی 
موهبتی طاهر
میر
میر جلیلی محمدرضا
میرباقری
میرباقری مرتضی
میرحسینی  غلامرضا 
میرزابزرگ محمدرضا
میرزابیگی محمد
میرزابیگی محمدرضا 
میرزاده حمید
میرزایی  محمدرضا 
میرسیدی
میرعنایت
میری محمودرضا
میلانی تهمینه 
میلانی فر
نازپرور بشیر
ناصحی عبدالمقیم
ناصر یکتا 
نامداری آزاده
نامی
نجف شعار
نجفی زارع نغمه 
نخجوانی احمد
نریمانی
نصرتی روح اله
نصیری
نصیری  شهرام 
نصیری طوسی
نصیری علی اکبر 
نصیری قیداری  سعداله 
نظر افضلی 
نظری  محمد 
نظری ایرج
نعمت الهی روزبه
نعمتی انارکی   داود 
نعمتی بهروز
نعمتی علی 
نفر محسن
نفریه
نقشینه علی 
نقلی
نگهبان سلامی محمود
نمکی سعید
نوبخت علی
نوبخت محمدباقر
نوده فراهانی
نوربالا محمدحسین
نوربخش محمدتقی
نوروزبیگی جواد
نوروزی احمدعلی 
نوری امیر
نيك اقباليان سامان
نیری سیدرضا
نیزاری خدیجه 
نیک روش
نیکخواه آزاد فرید
نیکفر لیالستانی ذبیح
نیکنام
نیکنام
هادی منوچهر
هاشم زاده چالشتری مرتضی
هاشمی رفسنجانی فاطمه
هاشمی همایون
هراتی و خانم انوشه جم
هره صدق سیامک
همتی احمد
همتی عبدالناصر
وجودی یزدی حسین
وکیلی محمدعلی
ولایتی
ولدبیگی سحر
ونکی
ویل پارکس
یارمحمدی علیم
یاسریان فر
یاسریانی
یحیوی جواد
یداللهی افشین 
یداللهی فاطمه 
یزدان پناه پرویز 
یزدانی مرضیه
یزدی زاده حاج حسین
یعقوبی
یقینی مرضیه
یلدا علی رضا
یوسف زاده شاهرخ
یوسف نژاد علی اصغر
یوسفی بیله سوار  سعید 
یوسفی همایون
یوسفیان ملا  عزت ا...';

        $park = '2
2
2
۲
2
2
1
2
2
2
2
2
2
2
2
2
2
2
1
1
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
۲
2
2
2
2
2
2
2
2
2
2
1
2
1
1
1
2
2
2
2
2
1
2
2
2
2
2
1
2
2
2
1
2
2
2
1
2
2
2
1
2
1
2
2
2
2
2
2
2
۲
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
1
2
2
2
2
2
2
1
1
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
1
2
2
۲
2
1
2
2
2
2
2
1
2
2
2
2
2
2
2
2
1
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
1
2
2
2
2
2
2
2
2
1
2
1
2
2
2
2
2
2
2
2
2
2
2
۲
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
1
2
2
1
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
1
2
2
2
2
2
2
2
2
2
2
1
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
1
2
2
1
2
2
1
2
2
2
2
2
2
1
2
1
2
1
2
۲
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
1
2
2
2
1
1
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
1
2
2
2
1
1
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
1
2
2
2
2
2
1
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
1
2
2
2
1
1
2
2
1
2
1
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
۲
2
۲
1
2
2
2
2
2
2
2
1
2
2
1
1
2
2
1
2
2
2
2
2
2
2
2
1
2
2
1
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
۲
2
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
1
2
۲
2
2
2
2
2
2
2
2
2
2
2
2
2
1
2
2
2
2
2
2
2
2
1
1
1
۲
2
1
2
2
2
2
2
2
2
2
2
2
۲
1
2
1
2
2
2
2
1
2
2
2
1
2
2
2
2
2
1
1
2
2
2
2
2
2
2
2
2
2
2
2';

        $name = explode("\n", $name);
        $park = explode("\n", $park);

        for ($i = 0; $i < count($name); $i++)
        {
            $data = array(
                'name' => htmlCoding(trim($name[$i])),
                'parck' => htmlCoding($park[$i]),
                'status' => 1,
            );
            $this->db->insert('invitees', $data);
            echo $name[$i] . ' - ' . $park[$i] . '<br>';
        }

        echo count($name) . ' - ' . count($park);

    }

//    public function index()
//    {
//
//        $invite = $this->db->select()->from('invitees')->order_by('name', 'asc')->get();
//        if ($invite->num_rows())
//        {
//            $invite = $invite->result_array();
//        }
//        else
//        {
//            $invite = false;
//        }
//
//        $data['invite'] = $invite;
//
//        $this->load->view('OnePage_template/header', $data);
//        $this->load->view('invite/0', $data);
//
//    }

    public function index()
    {

        $invite = $this->db->select()->from('lottery')->order_by('name', 'asc')->get();
        if ($invite->num_rows())
        {
            $invite = $invite->result_array();
        }
        else
        {
            $invite = false;
        }

        $data['invite'] = $invite;

        $this->load->view('OnePage_template/header', $data);
        $this->load->view('lottery/0', $data);

    }

    public function lottery()
    {

        $invite = $this->db->select()->from('lottery')->order_by('lottery', 'desc')->get();
        if ($invite->num_rows())
        {
            $invite = $invite->result_array();
        }
        else
        {
            $invite = false;
        }

        $data['invite'] = $invite;

        $this->load->view('OnePage_template/header', $data);
        $this->load->view('lottery/1', $data);

    }

    public function ajax_lottery_list()
    {

        $invite = $this->db->select()->from('lottery')->order_by('lottery', 'desc')->get();
        if ($invite->num_rows())
        {
            $invite = $invite->result_array();
        }
        else
        {
            $invite = false;
        }

        for ($i = 0, $a = 1; $i < count($invite); $i++)
        {
            $invite[$i]['row'] = pd($a);
            $invite[$i]['lottery'] = pd($invite[$i]['lottery']);
        }

        $data['lottory'] = $invite;
        $data['count'] = count($invite);
        echo json_encode($data);

    }

    public function ajax_lottery()
    {
        $id = $this->input->post('inID', true);
        $act = $this->input->post('inAct', true);
        $lott = $this->db->select()->from('lottery')->where('id', $id)->get();
        $lott = $lott->row_array();
        if($id && $act)
        {
            $update = array();
            if ($act == 'add')
            {
                $update['lottery'] = $lott['lottery']+1;
            }
            else
            {
                $update['lottery'] = $lott['lottery']-1;
            }

            $this->db->where('id', $id);
            $this->db->update('lottery', $update);

            $data['lottery'] = pd($update['lottery']);
            $data['status'] = 1;
            echo json_encode($data);

        }
        else
        {
            $data = 0;
            echo json_encode($data);
        }
    }

    public function ajax_invite()
    {
        $id = $this->input->post('inID', true);
        $act = $this->input->post('inAct', true);

        if($id && $act)
        {
            $update = array();
            if ($act == 'login')
            {
                $update['status'] = 2;
            }
            else
            {
                $update['status'] = 1;
            }

            $this->db->where('id', $id);
            $this->db->update('invitees', $update);

            $data = 1;
            echo json_encode($data);

        }
        else
        {
            $data = 0;
            echo json_encode($data);
        }
    }


}