<div class="modal fade" id="ehdaCardModal" tabindex="-1" role="dialog" aria-labelledby="ehdaCardModalLabel" aria-hidden="true">
    <div class="modal-dialog modal-lg">
        <div class="modal-content">
            <div class="modal-header">
                <button type="button" class="close" data-dismiss="modal" aria-label="Close" style="float: left"><span aria-hidden="true">&times;</span></button>
                <h4 class="modal-title" id="myModalLabel" style="font-family: 'webYekan';">کارت اهدای عضو</h4>
            </div>
            <div class="modal-body" style="font-family: 'BNazanin'; font-size: 18px; line-height: 28px; text-align: justify;">
                کارت اهدای عضو یکی از بزرگترین نمادهای فرهنگی در زمینه ارتقای فرهنگ اهدای عضو می باشد.
                <br><br>
                از زمان راه اندازی واحدهای فراهم آوری اعضای پیوندی در کشورمان، مراکز مختلفی شروع به ثبت نام و صدور کارت اهدای عضو نمودند. در روزها و ماه‌های اول تعداد ثبت نام به بیش از 100 نفر در ماه نمیرسید، اما با شروع تبلیغات فرهنگی و برگزاری جشن نفس، تعداد بیشتری از مردم نیک اندیش سرزمینمان با این امر مقدس آشنا شدند و تعداد افراد متقاضی کارت اهدای عضو  به بیش از 500 نفر در روز رسید...
                <br><br>
                تقاضای دریافت کارت اهدای عضو روز به روز بیشتر شد، به اندازه ای که مدت زمان دریافت کارت اهدای عضو برای هر فرد به بیش از 5ماه رسید. باتوجه به اینکه کارت اهدای عضو صرفاً نشان دهنده رضایت قلبی هر شخص برای اهدای عضو در زمان مرگ میباشد و جنبه‌‌ی قانونی ندارد؛ لذا بر آن شدیم تا سامانه ای راه اندازی کنیم که مدت زمان دریافت کارت را به طرز چشمگیری کاهش دهد تا انتظار رسیدن این کارت، مردم ایثارگر میهن عزیزمان را آزرده خاطر نسازد.
                <br><br>
                با توجه به مسائل فوق و همچنین پیرو تاکید مقام محترم وزارت بهداشت، درمان و آموزش پزشکی، ابداع روشی برای ثبت نام و صدور آنی کارت اهدای عضو در دستور کار این وزارت قرار گرفت و نتیجه تمامی بررسی ها، سامانه ای است که پیش روی شما می باشد. در این سامانه کد ملی هر فرد به صورت آنلاین کنترل شده و در صورتیکه اطلاعات مطابق کارت ملی وارد شده باشد، کارت اهدای عضو صادر شده و متقاضی میتواند همان لحظه کارت خود را ذخیره و چاپ نماید.
                <br><br>
                اطلاعات داوطلبین دریافت کارت بلافاصله وارد سامانه کشوری کارت اهدای عضو شده و در آن ذخیره می گردد. لازم به ذکر است این سامانه از طریق کلیه بیمارستانهای کشور قابل دسترسی بوده و امکان جستجوی نام افراد مرگ مغزی بستری در این بیمارستانها وجود دارد. 
                <br><br>
                امید است با راه اندازی این سامانه قدمی هرچند کوچک برای ارتقای فرهنگ مقدس اهدی عضو و نجات جان بیماران نیازمند به پیوند اعضا برداریم...
                <br><br>
                <strong>
                    درصورتی که قبلاً در این سامانه ثبت نام کرده اید، جهت ویرایش اطلاعات شخصی و یا چاپ مجدد کارت خود برروی دکمه ورود به سامانه کلیک نمائید، در غیر اینصورت  جهت ثبت نام و دریافت کارت اهدای عضو خود برروی دکمه ثبت نام کارت اهدای عضو کلیک نمائید.
                </strong>

            </div>
            <div class="modal-footer" style="text-align: left;">
                
                <div class="btn-group" role="group" aria-label="btn" style="margin: 0 auto; text-align: center;">
                    <button type="button" class="btn btn-info taha" id="ehdaCardLoginForm">ورود به سامانه کارت اهدای عضو</button>
                    <button type="button" class="btn btn-success taha" id="ehdaCardRegisterForm">ثبت نام کارت اهدای عضو</button>
                </div>
                <button type="button" class="btn btn-default taha" data-dismiss="modal" id="ehdaCardModalClose">انصراف</button>
                
            </div>
        </div>
    </div>
</div>