<div style="clear: both;"></div>
<div class="blueSection">
    <div class="container">
        <h2>تاریخچه اهدا و پیوند اعضا در ایران (دکتر ایرج فاضل)</h2>
    </div>
</div>
<div class="container" style="color: #000000;">
    <div class="panel panel-success" style="padding-top: 30px;">
        <div class="row">
            <div class="col-1"></div>
            <div class="col-10">
                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">گرچه درنوشته های بزرگان و شخصیت های برجسته پزشکی قدیم ایران از جمله حکیم ابن سینا و اسمعیل جرجانی اشاراتی وجود دارد که میتواند بعنوان اولین برداشت مبهم از مسئله انتقال اعضاء باشد ولی پیوند اعضاء به مفهوم مدرن و کنونی آن یعنی جایگزینی یک عضو با عضو مشابه درطب ایران درسال 1314 با انجام پیوند قرنیه توسط استاد صاحب نام جراحی چشم و پایه گزار چشم پزشکی مدرن درایران شادروان دکتر شمس در تهران انجام شد و با آموزش دستیاران و جراحان چشم دراین بخش ادامه یافت و به دنبال آن و با کمی فاصله دکتر خدادوست استاد جراحی چشم دانشگاه شیراز بصورت فعال و چشم گیری اینکار را دنبال کرد و پیوند قرنیه که سخت مورد نیاز بسیاری از بیماران بود در اکثر بخش های جراحی چشم مملکت قابل انجام وارائه شد. دراینجا لازم است به نقش ارزشمند دکتر حمید سجادی استاد چشم دانشگاه شهید بهشتی دردوران پس از انقلاب نیز اشاره شود. درحال حاضر دربیش از صد مرکز درایران این عمل انجام می شود و شمار بیمارانی که پیوند قرنیه شده اند از پنجاه هزار نفر گذشته است.</span></p>

                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">اولین پیوند کلیه ایران در سال 1347 در بیمارستان نمازی در دانشگاه شیراز توسط دکتر سنادی زاده استاد این دانشگاه انجام شد که بعنوان یک واقعه مهم بازتاب وسیعی در رسانه های درون مرزی پیدا کرد وموجب شد این عمل درهمین دانشگاه و هم چنین در بیمارستانهای دانشگاه تهران انجام شود و به این ترتیب از سال 1347 تا سال 1357 نزدیک به 80 مورد پیوند کلیه انجام شد ، بدون آنکه برنامه سازمان یافته و منظمی جهت انجام عمل پیوند کلیه و تربیت تیم های جدید تدوین شود. درطول این دهه تعداد بیشتری بیمار نیازمند کلیه (نزدیک به چهارصد نفر) با صرف هزینه های سنگین و تحمل شرایط غربت و انتظار طولانی درخارج از ایران به ویژه در انگلستان پیوند کلیه دریافت کردند.</span></p>

                <p dir="rtl" style="text-align: center;"><span style="font-size:14px"><img alt="" src="http://ehda.center/assets/uploads/i.jpg" /></span></p>

                <p dir="rtl" style="text-align: center;"><em><span style="font-size:12px"><span style="color:rgb(128, 0, 0)">دکتر سید محمد سنادی زاده- جراح اولین پیوند کلیه در ایران</span></span></em></p>

                <p dir="rtl" style="text-align: center;"><span style="font-size:14px"><img alt="" src="http://ehda.center/assets/uploads/k.jpg" /></span></p>

                <p dir="rtl" style="text-align: center;"><span style="color:#800000"><em><span style="font-size:12px">بیمارستان نمازی شیراز- جایی که اولین پیوند موفق کبد توسط دکتر ملک حسینی در آن انجام شد.</span></em></span></p>

                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">اکثر کلیه های مورد استفاده برای پیوند درآن زمان با قیمت گزاف از شبکه یوروترانسپلانت خریداری می شد ودرمواردی سبب انتقال بیماری و مرگ بیماران دریافت کننده کلیه شد . باشروع تحولات اجتماعی گسترده و وسیع درسال 1357 و شرایط انقلابی درایران و مهاجرت بسیاری از افراد از جمله جراحانی که موارد پیوند را انجام میدادند عمل پیوند درایران بکلی متوقف شد و با شرایط متشنج اجتماعی و درپی آن حمله ارتش عراق به ایران و شروع جنگ هشت ساله موقتاً به بوته فراموشی سپرده شد . به زودی در اثر فشار تحریم ها و کمبود شدید لوازم طبی و دارویی بخش های همودیالیز که کلاً از خارج تامین می شد دچار مشکل جدی درتامین نیازهای خود شدند و مشکل به حدی بالا گرفت که دربعضی مراکز از جمله رشت و همدان به دلیل عدم دسترسی به دیالیز مرگ دسته جمعی تعداد زیادی بیمار وجدان عمومی را جریحه دار کرد ه و موجب نگرانی شدید شد. درچنین وضعی ، علیرغم سایه شوم جنگ بر مملکت و اختصاص تقریباً تمامی امکانات درمانی مملکت به مجروحین جنگی تنها راه نجات این بیماران انجام پیوند کلیه درایران بود. جالب است این نکته ذکر شود که حتی پیشنهاد انجام عمل پیوند کلیه ، موجب تعجب و حیرت بسیاری حتی همکاران پزشک می شد و طرح این موضوع بعنوان یک عمل لوکس و فانتزی در اوضاع و احوال موجود برایشان غیر منتظره و عجیب می نمود.</span></p>

                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">درچنین شرایطی ، راقم این سطور که قبلاً در آمریکا در شهر دیتون ایالت اهایو عمل پیوند کلیه را شروع کرده و بخش آن را چند سال اداره کرده بود به غریبانه و به تنهایی عمل پیوند را با امکانات بسیار ابتدایی در آذر ماه سال 1362 در بیمارستان شهید مصطفی خمینی و همراه با انجام جراحیهای مجروحان جنگی شروع کرد. در اولین عمل ، کلیه یک برادر به خواهر 21 ساله او پیوند شد و خوشبختانه کلیه بدون عارضه، فونکسیون رضایت بخشی را شروع کرد . در آن زمان ایموران و پردنیزولون در دسترس بود که مورد استفاده قرار گرفت و بیمار و اهدا کننده کلیه هر دو شادمان و باحال عمومی بسیار خوب مرخص شدند . پس از آن چند مورد مشابه پیوند به همین ترتیب انجام شد و با جلب توجه همکاران نفرولوژیست و اظهار علاقه آنها به مشارکت درطی سالهای 1361 تا 1363 تعداد 50 عمل پیوند در بیمارستانهای مختلف از جمله شهید مصطفی خمینی، سامان، شرکت نفت، شهید رهنمون کنونی و بیمارستان طالقانی انجام شد و با تحلیل نتایج بسیار رضایتبخش آن برنامه اساسی پیوند کلیه در ایران طراحی شد و اصول آن از جمله لزوم انجام عمل پیوند در بیمارستانهای دانشگاهی ، آموزش گسترده تیم های پیوند و استفاده از دهنده فامیل ، طراحی و برای اولین بار درسال 1363 در بیمارستان هاشمی نژاد به مورد اجرا گذاشته شد و از همان آغاز کار ، همکاران علاقمند جهت آموزش دراین برنامه پذیرفته شدند و پایه کار برای شروع اعمال پیوند در شهرستانهااز جمله شیراز و اصفهان و سایر شهرها گذاشته شد. لازم به ذکر است که در شروع این برنامه تبلیغات منفی بسیار وسیعی از طرف شبکه های معرفی بیمار به خارج و به خصوص انگلستان که منافع مالی آنها به خطر افتاده بود به راه افتاد ولی موفقیت درخشان عمل های پیوند این تبلیغات را خنثی و منتفی کرد و هرروز نامهای جدیدی به فهرست تقاضا کنندگان عمل های پیوند افزوده می شد.</span></p>

                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">در سال 1364 دومین مرکز پیوند کلیه در بیمارستان لبافی نژاد به همت دکتر ناصر سیم فروش به راه افتاد و یکسال بعد اولین مورد پیوند کلیه از دهنده غیر فامیل در این مرکز انجام شد . درحال حاضر بیش از 26 مرکز پیوند کلیه در ایران وجود دارد و هرسال بین 1400-1200 پیوند کلیه در سراسر مملکت انجام می شود.</span></p>

                <p dir="rtl" style="text-align: center;"><span style="font-size:14px"><img alt="" src="http://ehda.center/assets/uploads/j.jpg" /></span></p>

                <p dir="rtl" style="text-align: center;"><em><span style="font-size:12px"><span style="color:rgb(128, 0, 0)">دکتر سیم فروش- جراح کلیه و موسس دومین مرکز پیوند کلیه در بیمارستان لبافی نژاد</span></span></em></p>

                <p dir="rtl" style="text-align: justify;"><br />
                    <span style="font-size:14px">با توجه به افزایش افراد نیازمند پیوند ولزوم پیوند هایی غیر از کلیه مانند قلب و ریه و کبد ، لازم بود درجهت استفاده از اعضاء قربانیان مرگ مغزی اقداماتی انجام شود . در ابتدا درتاریخ 1368/02/31 در پاسخ سئوال نویسنده این سطور از محضرحضرت امام خمینی (ره) فتوای مرگ مغزی از طرف ایشان بعنوان اولین فقیه شیعه صادر شد. ولی لازم بود قانون مرگ مغزی نیز به تصویب برسد زیرا فتواها عموماً در دادگاهها قابل استناد نیستند . جالب است که این قانون دو بار درمجلس شورای اسلامی با استدلال های سطحی و غالباً بی اساس رد شد ولی بالا خره به تصویب رسید و راه برای انجام انواع پیوند ها وگسترش پیوند کلیه هموار شد. پیوند مغز استخوان درسال 1370 توسط دکتر قوام زاده استاد دانشگاه تهران آغاز شد و درمرکزی که توسط نامبرده پایه گذاری شد متجاوز از سه هزار پیوند انجام شده است و علاوه بر آن چند مرکز فعال دیگر نیز به اینکار اختصاص داده شده اند.</span></p>

                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">اولین پیوند موفق روده باریک در چهاردهم اردیبهشت ماه سال 1371 توسط دکتر ایرج فاضل در بیمارستان آیت ا... طالقانی انجام شد.</span></p>

                <p dir="rtl" style="text-align: center;"><span style="font-size:14px"><img alt="" src="http://ehda.center/assets/uploads/l.JPG" style="height:160px; width:150px" /></span></p>

                <p dir="rtl" style="text-align: center;"><span style="color:#800000"><span style="font-size:12px"><em>دکتر ایرج فاضل- جراح اولین پیوند روده باریک در ایران</em></span></span></p>

                <p dir="rtl" style="text-align: justify;"><br />
                    <span style="font-size:14px">اولین پیوند موفق کبد درایران در روز چهاردهم خرداد ماه سال 1372 توسط دکتر ملک حسینی استاد دانشگاه شیراز انجا م گرفت و از آن زمان ، دانشگاه شیراز بعنوان یک مرکز موفق پیوند کبد به فعالیت گسترده خودادامه داده است.</span></p>

                <p dir="rtl" style="text-align: center;"><span style="font-size:14px"><img alt="" src="http://ehda.center/assets/uploads/m.jpg" /></span></p>

                <p dir="rtl" style="text-align: center;"><span style="color:#800000"><em><span style="font-size:12px">دکتر سید علی ملک حسینی- جراح اولین پیوند موفق کبد در ایران</span></em></span></p>

                <p dir="rtl" style="text-align: justify;"><br />
                    <span style="font-size:14px">اولین پیوند موفق قلب در تیرماه سال 1372 توسط دکتر حسین ماندگار در بیمارستان شریعتی دانشگاه تهران انجام شد و درحال حاضر این عمل درپنج مرکز مختلف انجام می شود.</span></p>

                <p dir="rtl" style="text-align: center;"><span style="font-size:14px"><img alt="" src="http://ehda.center/assets/uploads/n.jpg" /></span></p>

                <p dir="rtl" style="text-align: center;"><span style="color:#800000"><em><span style="font-size:12px">اولین پیوند قلب در ایران</span></em></span></p>

                <p dir="rtl" style="text-align: justify;"><br />
<span style="font-size:14px">در سال 1374 انجمن پیوند اعضاء ایران تاسیس شد.<br />
درسال 1379 اولین پیوند موفق ریه توسط دکتر احمدی استاد دانشگاه در بیمارستان امام خمینی دانشگاه تهران انجام شد و با کوشش قابل توجه دکتر عباسی دربیمارستان مسیح دانشوری ادامه پیدا کرد.<br />
اولین پیوند پانکراس توسط دکتر نیک اقبالیان در فروردین ماه سال 1385 در دانشگاه شیراز انجام شد و با موفقیت ادامه یافت.</span></p>

                <p dir="rtl" style="text-align: justify;"><span style="font-size:14px">در طی سالهای اخیر توجه و کوشش زیادی برای استفاده هرچه بیشتر از ارگانهای قربانیان مرگ مغزی برای نجات جان بیماران نیازمند صورت گرفته و امید می رود با ادامه این تلاشها استفاده از کلیه اهدا کنندگان زنده غیر فامیل و فروش عضو هرچه کمرنگ تر و محدود تر شده و با ارگانهای قربانیان مرگ مغزی جایگزین شود.</span></p>

            </div>
            <div class="col-1"></div>
        </div>
        </div>

    <div style="clear: both; margin-top: 30px;"></div>

</div>